{"word":"schools","rank":2406,"occurrence":0.0031335,"records":[{"word":"schools","phonetic":"/skuːlz/","phonetics":[{"text":"/skuːlz/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"(collective) A group of fish or a group of marine mammals such as porpoises, dolphins, or whales.","synonyms":[],"antonyms":[],"example":"The divers encountered a huge school of mackerel."},{"definition":"A multitude.","synonyms":[],"antonyms":[]}],"synonyms":["shoal"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"(of fish) To form into, or travel in a school.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"An institution dedicated to teaching and learning; an educational institution.","synonyms":[],"antonyms":[],"example":"Harvard University is a famous American postsecondary school."},{"definition":"An educational institution providing primary and secondary education, prior to tertiary education (college or university).","synonyms":[],"antonyms":[]},{"definition":"At Eton College, a period or session of teaching.","synonyms":[],"antonyms":[],"example":"Divinity, history and geography are studied for two schools per week."},{"definition":"Within a larger educational institution, an organizational unit, such as a department or institute, which is dedicated to a specific subject area.","synonyms":[],"antonyms":[],"example":"We are enrolled in the same university, but I attend the School of Economics and my brother is in the School of Music."},{"definition":"An art movement, a community of artists.","synonyms":[],"antonyms":[],"example":"The Barbizon school of painters were part of an art movement towards Realism in art, which arose in the context of the dominant Romantic Movement of the time."},{"definition":"(considered collectively) The followers of a particular doctrine; a particular way of thinking or particular doctrine; a school of thought.","synonyms":[],"antonyms":[],"example":"These economists belong to the monetarist school."},{"definition":"The time during which classes are attended or in session in an educational institution.","synonyms":[],"antonyms":[],"example":"I'll see you after school."},{"definition":"The room or hall in English universities where the examinations for degrees and honours are held.","synonyms":[],"antonyms":[]},{"definition":"The canons, precepts, or body of opinion or practice, sanctioned by the authority of a particular class or age.","synonyms":[],"antonyms":[],"example":"He was a gentleman of the old school."},{"definition":"An establishment offering specialized instruction, as for driving, cooking, typing, coding, etc.","synonyms":[],"antonyms":[]}],"synonyms":["academy","college","university","college","department","faculty","institute"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To educate, teach, or train (often, but not necessarily, in a school).","synonyms":[],"antonyms":[],"example":"Many future prime ministers were schooled in Eton."},{"definition":"To defeat emphatically, to teach an opponent a harsh lesson.","synonyms":[],"antonyms":[]},{"definition":"To control, or compose, one's expression.","synonyms":[],"antonyms":[],"example":"She took care to school her expression, not giving away any of her feelings."}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/school","https://en.wiktionary.org/wiki/schools"]}]}