{"word":"channels","rank":6732,"occurrence":0.0007577,"records":[{"word":"channels","phonetic":"/ˈtʃænəlz/","phonetics":[{"text":"/ˈtʃænəlz/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The physical confine of a river or slough, consisting of a bed and banks.","synonyms":[],"antonyms":[],"example":"The water coming out of the waterwheel created a standing wave in the channel."},{"definition":"The natural or man-made deeper course through a reef, bar, bay, or any shallow body of water.","synonyms":[],"antonyms":[],"example":"A channel was dredged to allow ocean-going vessels to reach the city."},{"definition":"The navigable part of a river.","synonyms":[],"antonyms":[],"example":"We were careful to keep our boat in the channel."},{"definition":"A narrow body of water between two land masses.","synonyms":[],"antonyms":[],"example":"The English Channel lies between France and England."},{"definition":"Something through which another thing passes; a means of conveying or transmitting.","synonyms":[],"antonyms":[],"example":"The news was conveyed to us by different channels."},{"definition":"A gutter; a groove, as in a fluted column.","synonyms":[],"antonyms":[]},{"definition":"A connection between initiating and terminating nodes of a circuit.","synonyms":[],"antonyms":[],"example":"The guard-rail provided the channel between the downed wire and the tree."},{"definition":"The narrow conducting portion of a MOSFET transistor.","synonyms":[],"antonyms":[]},{"definition":"(communication) The part that connects a data source to a data sink.","synonyms":[],"antonyms":[],"example":"A channel stretches between them."},{"definition":"(communication) A path for conveying electrical or electromagnetic signals, usually distinguished from other parallel paths.","synonyms":[],"antonyms":[],"example":"We are using one of the 24 channels."},{"definition":"(communication) A single path provided by a transmission medium via physical separation, such as by multipair cable.","synonyms":[],"antonyms":[],"example":"The channel is created by bonding the signals from these four pairs."},{"definition":"(communication) A single path provided by a transmission medium via spectral or protocol separation, such as by frequency or time-division multiplexing.","synonyms":[],"antonyms":[],"example":"Their call is being carried on channel 6 of the T-1 line."},{"definition":"A specific radio frequency or band of frequencies, usually in conjunction with a predetermined letter, number, or codeword, and allocated by international agreement.","synonyms":[],"antonyms":[],"example":"KNDD is the channel at 107.7 MHz in Seattle."},{"definition":"A specific radio frequency or band of frequencies used for transmitting television.","synonyms":[],"antonyms":[],"example":"NBC is on channel 11 in San Jose."},{"definition":"(storage) The portion of a storage medium, such as a track or a band, that is accessible to a given reading or writing station or head.","synonyms":[],"antonyms":[],"example":"This chip in this disk drive is the channel device."},{"definition":"(technic) The way in a turbine pump where the pressure is built up.","synonyms":[],"antonyms":[],"example":"The liquid is pressurized in the lateral channel."},{"definition":"A distribution channel","synonyms":[],"antonyms":[]},{"definition":"A particular area for conversations on an IRC network, analogous to a chat room and often dedicated to a specific topic.","synonyms":[],"antonyms":[]},{"definition":"An obsolete means of delivering up-to-date Internet content.","synonyms":[],"antonyms":[]},{"definition":"A psychic or medium who temporarily takes on the personality of somebody else.","synonyms":[],"antonyms":[]}],"synonyms":["groove","gutter","passage","sound","strait","side","station"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To make or cut a channel or groove in.","synonyms":[],"antonyms":[]},{"definition":"To direct or guide along a desired course.","synonyms":[],"antonyms":[],"example":"We will channel the traffic to the left with these cones."},{"definition":"(of a spirit, as of a dead person) To serve as a medium for.","synonyms":[],"antonyms":[],"example":"She was channeling the spirit of her late husband, Seth."},{"definition":"To follow as a model, especially in a performance.","synonyms":[],"antonyms":[],"example":"He was trying to channel President Reagan, but the audience wasn't buying it."}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"The wale of a sailing ship which projects beyond the gunwale and to which the shrouds attach via the chains. One of the flat ledges of heavy plank bolted edgewise to the outside of a vessel, to increase the spread of the shrouds and carry them clear of the bulwarks.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"Formal lines of command and procedure.","synonyms":[],"antonyms":[],"example":"I'd love to be able to help you, but you'll have put that request through channels."}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/channel","https://en.wiktionary.org/wiki/channels"]}]}