{"word":"bonds","rank":4506,"occurrence":0.0014105,"records":[{"word":"bonds","phonetic":"/bɒndz/","phonetics":[{"text":"/bɒndz/","audio":""},{"text":"/bɑndz/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/bonds-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=2453874","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Evidence of a long-term debt, by which the bond issuer (the borrower) is obliged to pay interest when due, and repay the principal at maturity, as specified on the face of the bond certificate. The rights of the holder are specified in the bond indenture, which contains the legal terms and conditions under which the bond was issued. Bonds are available in two forms: registered bonds, and bearer bonds.","synonyms":[],"antonyms":[]},{"definition":"A documentary obligation to pay a sum or to perform a contract; a debenture.","synonyms":[],"antonyms":[],"example":"Investors face a quandary. Cash offers a return of virtually zero in many developed countries; government-bond yields may have risen in recent weeks but they are still unattractive. Equities have suffered two big bear markets since 2000 and are wobbling again. It is hardly surprising that pension funds, insurers and endowments are searching for new sources of return."},{"definition":"A partial payment made to show a provider that the customer is sincere about buying a product or a service. If the product or service is not purchased the customer then forfeits the bond.","synonyms":[],"antonyms":[]},{"definition":"(often in the plural) A physical connection which binds, a band.","synonyms":[],"antonyms":[],"example":"The prisoner was brought before the tribunal in iron bonds."},{"definition":"An emotional link, connection or union; that which holds two or more people together, as in a friendship; a tie.","synonyms":[],"antonyms":[],"example":"They had grown up as friends and neighbors, and not even vastly differing political views could break the bond of their friendship."},{"definition":"Moral or political duty or obligation.","synonyms":[],"antonyms":[]},{"definition":"A link or force between neighbouring atoms in a molecule.","synonyms":[],"antonyms":[],"example":"Organic chemistry primarily consists of the study of carbon bonds, in their many variations."},{"definition":"A binding agreement, a covenant.","synonyms":[],"antonyms":[],"example":"Herbert resented his wife for subjecting him to the bonds of matrimony; he claimed they had gotten married while drunk."},{"definition":"A bail bond.","synonyms":[],"antonyms":[],"example":"The bailiff released the prisoner as soon as the bond was posted."},{"definition":"Any constraining or cementing force or material.","synonyms":[],"antonyms":[],"example":"A bond of superglue adhered the teacups to the ceiling, much to the consternation of the cafe owners."},{"definition":"In building, a specific pattern of bricklaying.","synonyms":[],"antonyms":[]},{"definition":"In Scotland, a mortgage.","synonyms":[],"antonyms":[]},{"definition":"A heavy copper wire or rod connecting adjacent rails of an electric railway track when used as a part of the electric circuit.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To connect, secure or tie with a bond; to bind.","synonyms":[],"antonyms":[],"example":"The gargantuan ape was bonded in iron chains and carted onto the stage."},{"definition":"To cause to adhere (one material with another).","synonyms":[],"antonyms":[],"example":"The children bonded their snapshots to the scrapbook pages with mucilage."},{"definition":"To form a chemical compound with.","synonyms":[],"antonyms":[],"example":"Under unusual conditions, even gold can be made to bond with other elements."},{"definition":"To guarantee or secure a financial risk.","synonyms":[],"antonyms":[],"example":"The contractor was bonded with a local underwriter."},{"definition":"To form a friendship or emotional connection.","synonyms":[],"antonyms":[],"example":"The men had bonded while serving together in Vietnam."},{"definition":"To put in a bonded warehouse; to secure (goods) until the associated duties are paid.","synonyms":[],"antonyms":[]},{"definition":"To lay bricks in a specific pattern.","synonyms":[],"antonyms":[]},{"definition":"To make a reliable electrical connection between two conductors (or any pieces of metal that may potentially become conductors).","synonyms":[],"antonyms":[],"example":"A house's distribution panel should always be bonded to the grounding rods via a panel bond."},{"definition":"To bail out by means of a bail bond.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"A peasant; churl.","synonyms":[],"antonyms":[]},{"definition":"A vassal; serf; one held in bondage to a superior.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"Imprisonment, captivity","synonyms":[],"antonyms":[]},{"definition":"The condition of goods in a bonded warehouse until duty is paid","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/bond","https://en.wiktionary.org/wiki/bonds"]}]}