{"word":"outside","rank":672,"occurrence":0.0111849,"records":[{"word":"outside","phonetics":[],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The part of something that faces out; the outer surface.","synonyms":[],"antonyms":[],"example":"He's repainting the outside of his house."},{"definition":"The external appearance of someone or something.","synonyms":[],"antonyms":[],"example":"Her outside was stern, but inside was a heart of gold."},{"definition":"The space beyond some limit or boundary.","synonyms":[],"antonyms":[],"example":"Viewed from the outside, the building seemed unremarkable."},{"definition":"The furthest limit, as to number, quantity, extent, etc.","synonyms":[],"antonyms":[],"example":"It may last a week at the outside."},{"definition":"The part of a road towards the central division: towards the right if one drives on the left, or towards the left if one drives on the right.","synonyms":[],"antonyms":[],"example":"On a motorway, you should always overtake other vehicles on the outside."},{"definition":"The side of a curved road, racetrack etc. that has the longer arc length; the side of a racetrack furthest from the interior of the course or some other point of reference.","synonyms":[],"antonyms":[],"example":"On the final bend, the second-place car tried to go around the outside of the leader but spun off into the barrier."},{"definition":"A passenger riding on the outside of a coach or carriage.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"Of or pertaining to the outer surface, limit or boundary.","synonyms":[],"antonyms":[],"example":"The outside surface looks good."},{"definition":"Of, pertaining to or originating from beyond the outer surface, limit or boundary.","synonyms":[],"antonyms":[]},{"definition":"Away from the interior or center of something.","synonyms":[],"antonyms":[]},{"definition":"Originating from, arranged by, or being someone outside an organization, group, etc.","synonyms":[],"antonyms":[],"example":"The Board did not trust outside information about their rivals."},{"definition":"Extending or going beyond the borders or scope of an organization, group, etc.","synonyms":[],"antonyms":[]},{"definition":"(of a pitch) Away (far) from the batter as it crosses home plate.","synonyms":[],"antonyms":[],"example":"The first pitch is ... just a bit outside."},{"definition":"Reaching the extreme or farthest limit, as to extent, quantity, etc; maximum.","synonyms":[],"antonyms":[],"example":"an outside estimate"},{"definition":"Positioned towards the central division of a road: towards the right-hand side if one drives on the left, or left-hand side if one drives on the right.","synonyms":[],"antonyms":[],"example":"the outside lane of the motorway"},{"definition":"(of a person) Not legally married to or related to (e.g. not born in wedlock to), and/or not residing with, a specified other person (parent, child, or partner); (of a marriage, relationship, etc) existing between two such people. (Compare out of wedlock, nonresidential.)","synonyms":[],"antonyms":["inside"]}],"synonyms":[],"antonyms":["inside"]},{"partOfSpeech":"adverb","definitions":[{"definition":"To or in the outdoors or outside; to or in an area that is beyond the scope, limits or borders of a given place.","synonyms":[],"antonyms":[],"example":"I am going outside."},{"definition":"Outdoors.","synonyms":[],"antonyms":[],"example":"I slept outside last night."}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"preposition","definitions":[{"definition":"On the outside of, not inside (something, such as a building).","synonyms":[],"antonyms":[]},{"definition":"Beyond the scope, limits or borders of.","synonyms":[],"antonyms":[],"example":"tourists from outside the country"},{"definition":"Near, but not in.","synonyms":[],"antonyms":[]},{"definition":"(usually with “of”) Except, apart from.","synonyms":[],"antonyms":[],"example":"Outside of winning the lottery, the only way to succeed is through many years of hard work."}],"synonyms":[],"antonyms":["inside"]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/outside"]}]}