{"word":"diplomatic","rank":6200,"occurrence":0.0008714,"records":[{"word":"diplomatic","phonetic":"/ˌdɪpləˈmætɪk/","phonetics":[{"text":"/ˌdɪpləˈmætɪk/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/diplomatic-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=180921","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The science of diplomas, or the art of deciphering ancient writings and determining their age, authenticity, etc.; paleography.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"Concerning the relationships between the governments of countries.","synonyms":[],"antonyms":[],"example":"Albania immediately severed diplomatic relations with Zimbabwe."},{"definition":"Exhibiting diplomacy; exercising tact or courtesy; using discussion to avoid hard feelings, fights or arguments.","synonyms":[],"antonyms":[],"example":"Thoughtful corrections can be diplomatic as well as instructional."},{"definition":"Describing a publication of a text which follows a single basic manuscript, but with variants in other manuscripts noted in the critical apparatus","synonyms":[],"antonyms":[],"example":"Whereas a diplomatic edition uses as its base text a single, \"best\" manuscript, to which other textual evidence is collated and organized into an apparatus, a critical text of the LXX/OG [= Septuagint or Old Greek] may be described as a collection of the oldest recoverable texts, carefully restored book by book (or section by section), aiming at achieving the closest approximation to the original translations (from Hebrew or Aramaic) or compositions (in Greek), systematically reconstructed from the widest array of relevant textual data (including controlled conjecture).  The International Organization for Septuagint and Cognate Studies, Critical Editions of Septuagint/Old Greek Texts."},{"definition":"Relating to diplomatics, or the study of old texts; paleographic.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/diplomatic"]}]}