{"word":"injection","rank":16202,"occurrence":0.0000794,"records":[{"word":"injection","phonetic":"/ɪn.ˈdʒɛk.ʃən/","phonetics":[{"text":"/ɪn.ˈdʒɛk.ʃən/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The act of injecting, or something that is injected.","synonyms":[],"antonyms":[]},{"definition":"A specimen prepared by injection.","synonyms":[],"antonyms":[]},{"definition":"A morphism from either one of the two components of a coproduct to that coproduct.","synonyms":[],"antonyms":[]},{"definition":"The act of inserting materials like concrete grout or gravel by using high pressure pumps.","synonyms":[],"antonyms":[]},{"definition":"The supply of additional funding to a person or a business.","synonyms":[],"antonyms":[],"example":"The troubled business received a much-needed cash injection."},{"definition":"A relation on sets (X,Y) that associates each element of Y with at most one element of X.","synonyms":[],"antonyms":[]},{"definition":"The insertion of program code into an application, URL, hardware, etc.; especially when malicious or when the target is not designed for such insertion.","synonyms":[],"antonyms":[],"example":"a SQL injection exploit allowing a malicious user to modify a database query"},{"definition":"The act of putting a spacecraft into a particular orbit, especially for changing a stable orbit into a transfer orbit, e.g. trans-lunar injection.","synonyms":[],"antonyms":[]},{"definition":"A function that maps distinct x in the domain to distinct y in the codomain; formally, a f: X → Y such that f(a) = f(b) implies a = b for any a, b in the domain.","synonyms":[],"antonyms":[]},{"definition":"(specifically) Something injected subcutaneously, intravenously, or intramuscularly by use of a syringe and a needle.","synonyms":[],"antonyms":[]},{"definition":"(steam engines) The act of throwing cold water into a condenser to produce a vacuum.","synonyms":[],"antonyms":[]},{"definition":"(steam engines) The cold water thrown into a condenser to produce a vacuum.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/injection"]}]}