{"word":"alternate","rank":5279,"occurrence":0.0011242,"records":[{"word":"alternate","phonetics":[],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"That which alternates with something else; vicissitude.","synonyms":[],"antonyms":[]},{"definition":"A substitute; an alternative; one designated to take the place of another, if necessary, in performing some duty.","synonyms":[],"antonyms":[]},{"definition":"A proportion derived from another proportion by interchanging the means.","synonyms":[],"antonyms":[]},{"definition":"A replacement of equal or greater value or function.","synonyms":[],"antonyms":[]},{"definition":"Figures or tinctures that succeed each other by turns.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To perform by turns, or in succession; to cause to succeed by turns; to interchange regularly.","synonyms":[],"antonyms":[]},{"definition":"To happen, succeed, or act by turns; to follow reciprocally in place or time; followed by with.","synonyms":[],"antonyms":[],"example":"The flood and ebb tides alternate with each other."},{"definition":"To vary by turns.","synonyms":[],"antonyms":[],"example":"The land alternates between rocky hills and sandy plains."},{"definition":"To perform an alternation (removal of alternate vertices) on (a polytope or tessellation); to remove vertices (from a face or edge) as part of an alternation.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"Happening by turns; one following the other in succession of time or place; first one and then the other (repeatedly)","synonyms":[],"antonyms":[],"example":"alternate picking is a guitar playing technique"},{"definition":"Designating the members in a series, which regularly intervene between the members of another series, as the odd or even numbers of the numerals; every other; every second.","synonyms":[],"antonyms":[],"example":"the alternate members 1, 3, 5, 7, etc."},{"definition":"Other; alternative.","synonyms":[],"antonyms":[],"example":"He lives in an alternate universe and an alternate reality."},{"definition":"(of leaves) Distributed singly at different heights of the stem, and at equal intervals as respects angular divergence.","synonyms":[],"antonyms":[],"example":"Many trees have alternate leaf arrangement (e.g. birch, oak and mulberry)."}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/alternate"]}]}