{"word":"focus","rank":9720,"occurrence":0.0003477,"records":[{"word":"focus","phonetic":"/ˈfəʊ.kəs/","phonetics":[{"text":"/ˈfəʊ.kəs/","audio":""},{"text":"/ˈfoʊ.kəs/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A point at which reflected or refracted rays of light converge.","synonyms":[],"antonyms":[],"example":"The heat of sunlight at the focus of a magnifying glass can easily set dry leaves on fire."},{"definition":"A point of a conic at which rays reflected from a curve or surface converge.","synonyms":[],"antonyms":[]},{"definition":"The fact of the convergence of light on the photographic medium.","synonyms":[],"antonyms":[],"example":"Unfortunately, the license plate is out of focus in this image."},{"definition":"The quality of the convergence of light on the photographic medium.","synonyms":[],"antonyms":[],"example":"During this scene, the boy’s face shifts subtly from soft focus into sharp focus."},{"definition":"Concentration of attention.","synonyms":[],"antonyms":[],"example":"I believe I can bring the high degree of focus required for this important job."},{"definition":"The exact point of where an earthquake occurs, in three dimensions (underneath the epicentre).","synonyms":[],"antonyms":[],"example":"The earthquake's focus was at exactly 37 degrees north, 18 degrees south, seventy five meters below the ground."},{"definition":"The indicator of the currently active element in a user interface.","synonyms":[],"antonyms":[],"example":"Text entered at the keyboard or pasted from a clipboard is sent to the component which currently has the focus."},{"definition":"The most important word or phrase in a sentence or passage, or the one that imparts information.","synonyms":[],"antonyms":[]},{"definition":"An object used in casting a magic spell.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"(followed by on or upon) To concentrate one's attention.","synonyms":[],"antonyms":[],"example":"I have to focus on my work."},{"definition":"To cause (rays of light, etc) to converge at a single point.","synonyms":[],"antonyms":[]},{"definition":"To adjust (a lens, an optical instrument) in order to position an image with respect to the focal plane.","synonyms":[],"antonyms":[],"example":"You'll need to focus the microscope carefully in order to capture the full detail of this surface."},{"definition":"To concentrate one’s attention.","synonyms":[],"antonyms":[],"example":"If you're going to beat your competitors, you need to focus."},{"definition":"To transfer the input focus to (a visual element), so that it receives subsequent input.","synonyms":[],"antonyms":[],"example":"The text box won't receive the user's keystrokes unless you explicitly focus it."}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/focus"]}]}