{"word":"be","rank":19,"occurrence":0.5662527,"records":[{"word":"be","phonetics":[],"meanings":[{"partOfSpeech":"verb","definitions":[{"definition":"(intransitive, now usually literary) To exist; to have real existence, to be alive.","synonyms":[],"antonyms":[],"example":"The Universe has no explanation: it just is."},{"definition":"(with there, or dialectally it, as dummy subject) To exist.","synonyms":[],"antonyms":[],"example":"There is just one woman in town who can help us. (or, dialectally:) It is just one woman in town who can help us."},{"definition":"(intransitive) To occupy a place.","synonyms":[],"antonyms":[],"example":"The cup is on the table."},{"definition":"(intransitive) To occur, to take place.","synonyms":[],"antonyms":[],"example":"When will the meeting be?"},{"definition":"(intransitive, in perfect tenses) Elliptical form of \"be here\", \"go to and return from\" or similar, also extending to certain other senses of \"go\".","synonyms":[],"antonyms":[],"example":"The postman has been today, but my tickets have still not yet come."},{"definition":"(transitive, copulative) Used to indicate that the subject and object are the same.","synonyms":[],"antonyms":[],"example":"Knowledge is bliss."},{"definition":"(transitive, copulative, mathematics) Used to indicate that the values on either side of an equation are the same.","synonyms":[],"antonyms":[],"example":"3 times 5 is fifteen."},{"definition":"(transitive, copulative) Used to indicate that the subject is an instance of the predicate nominal.","synonyms":[],"antonyms":[],"example":"A dog is an animal. Dogs are animals."},{"definition":"(transitive, copulative) Used to indicate that the subject plays the role of the predicate nominal.","synonyms":[],"antonyms":[],"example":"François Mitterrand was president of France from 1981 to 1995."},{"definition":"(transitive, copulative) Used to indicate that the subject has the qualities described by an adjective.","synonyms":[],"antonyms":[],"example":"The sky is blue."},{"definition":"(transitive, copulative) Used to indicate that the subject has the qualities described by a noun or noun phrase.","synonyms":[],"antonyms":[],"example":"The sky is a deep blue today."},{"definition":"(transitive, auxiliary) Used to form the passive voice.","synonyms":[],"antonyms":[],"example":"The dog was saved by the boy."},{"definition":"(transitive, auxiliary) Used to form the continuous forms of various tenses.","synonyms":[],"antonyms":[],"example":"The woman is walking."},{"definition":"(auxiliary) Used to form the perfect aspect with certain intransitive verbs; this was more common in archaic use, especially with verbs indicating motion. \"He is finished\", and \"He is gone\" are common, but \"He is come\" is archaic.","synonyms":[],"antonyms":[],"example":""},{"definition":"(formal, transitive, auxiliary) Used to express future action as well as what is due to, intended to, or should happen.","synonyms":[],"antonyms":[],"example":"They are to be married next month."},{"definition":"(transitive, copulative) Used to link a subject to a measurement.","synonyms":[],"antonyms":[],"example":"This building is three hundred years old."},{"definition":"(transitive, copulative, with a cardinal numeral) Used to state the age of a subject in years.","synonyms":[],"antonyms":[],"example":"I’m 20. (= I am 20 years old.)"},{"definition":"(with a dummy subject it) Used to indicate the time of day.","synonyms":[],"antonyms":[],"example":"It is almost eight. (= It is almost eight o’clock.)"},{"definition":"(With since) Used to indicate passage of time since the occurrence of an event.","synonyms":[],"antonyms":[],"example":"It has been three years since my grandmother died. (similar to My grandmother died three years ago, but emphasizes the intervening period)"},{"definition":"(rare and regional, chiefly in the past tense) Used to link two noun clauses, the first of which is a day of the week, recurring date, month, or other specific time (on which the event of the main clause took place), and the second of which is a period of time indicating how long ago that day was. [from 15th c.]","synonyms":[],"antonyms":[],"example":"I saw her Monday was a week: I saw her a week ago last Monday (a week before last Monday)."},{"definition":"(often impersonal, with it as a dummy subject) Used to indicate weather, air quality, or the like.","synonyms":[],"antonyms":[],"example":"It is hot in Arizona, but it is not usually humid."},{"definition":"(dynamic / lexical \"be\", especially in progressive tenses, conjugated non-suppletively in the present tense, see usage notes) To exist or behave in a certain way.","synonyms":[],"antonyms":[],"example":"\"What do we do?\" \"We be ourselves.\""},{"definition":"(African-American Vernacular, Caribbean, auxiliary, not conjugated) To tend to do, often do; marks the habitual aspect.","synonyms":[],"antonyms":[],"example":""}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/oak"]},{"word":"be","phonetics":[],"meanings":[{"partOfSpeech":"preposition","definitions":[{"definition":"(dialectal, possibly dated) Alternative form of by. Also found in compounds, especially oaths, e.g. begorra.","synonyms":[],"antonyms":[],"example":""}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/oak"]}]}