{"word":"resonance","rank":16710,"occurrence":0.000071,"records":[{"word":"resonance","phonetic":"/ˈɹɛzənəns/","phonetics":[{"text":"/ˈɹɛzənəns/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The quality of being resonant.","synonyms":[],"antonyms":[]},{"definition":"A resonant sound, echo, or reverberation, such as that produced by blowing over the top of a bottle.","synonyms":[],"antonyms":[]},{"definition":"The sound produced by a hollow body part such as the chest cavity upon auscultation, especially that produced while the patient is speaking.","synonyms":[],"antonyms":[]},{"definition":"Something that evokes an association, or a strong emotion.","synonyms":[],"antonyms":[]},{"definition":"The increase in the amplitude of an oscillation of a system under the influence of a periodic force whose frequency is close to that of the system's natural frequency.","synonyms":[],"antonyms":[]},{"definition":"A short-lived subatomic particle or state of atomic excitation that results from the collision of atomic particles.","synonyms":[],"antonyms":[],"example":"2004, When experiments with the first ‘atom-smashers’ took place in the 1950s to 1960s, many short-lived heavier siblings of the proton and neutron, known as ‘resonances’, were discovered. — Frank Close, Particle Physics: A Very Short Introduction (Oxford 2004, p. 35)"},{"definition":"An increase in the strength or duration of a musical tone produced by sympathetic vibration.","synonyms":[],"antonyms":[]},{"definition":"The property of a compound that can be visualized as having two structures differing only in the distribution of electrons; mesomerism.","synonyms":[],"antonyms":[]},{"definition":"A influence of the gravitational forces of one orbiting object on the orbit of another, causing periodic perturbations.","synonyms":[],"antonyms":[]},{"definition":"The condition where the inductive and capacitive reactances have equal magnitude.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/resonance"]}]}