{"word":"prescription","rank":10177,"occurrence":0.0003076,"records":[{"word":"prescription","phonetic":"/pɝˈskɹɪpʃən/","phonetics":[{"text":"/pɝˈskɹɪpʃən/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/prescription-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=90000050"}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The act of prescribing a rule, law, etc..","synonyms":[],"antonyms":[],"example":"\"Jurisdiction to prescribe\" is a state's authority to make its laws applicable to certain persons or activities. -- Richard G. Alexander, Iran and Libya Sanctions Act of 1996: Congress exceeds its jurisdiction to prescribe law. Washington and Lee Law Review, 1997."},{"definition":"Also called extinctive prescription or liberative prescription. A time period within which a right must be exercised, otherwise it will be extinguished.","synonyms":[],"antonyms":[]},{"definition":"Also called acquisitive prescription. A time period after which a person who has, in the role of an owner, uninterruptedly, peacefully, and publicly possessed another's property acquires the property. The described process is known as acquisition by prescription and adverse possession.","synonyms":[],"antonyms":[]},{"definition":"A written order, as by a physician or nurse practitioner, for the administration of a medicine or other intervention. See also scrip.","synonyms":[],"antonyms":[],"example":"The surgeon wrote a prescription for a pain killer and physical therapy."},{"definition":"The prescription medicine or intervention so prescribed.","synonyms":[],"antonyms":[],"example":"The pharmacist gave her a bottle containing her prescription."},{"definition":"The formal description of the lens geometry needed for spectacles, etc..","synonyms":[],"antonyms":[],"example":"The optician followed the optometrist's prescription for her new eyeglasses."},{"definition":"The act or practice of laying down norms of language usage, as opposed to description, i.e. recording and describing actual usage.","synonyms":[],"antonyms":[]},{"definition":"An instance of a prescriptive pronouncement.","synonyms":[],"antonyms":[]},{"definition":"A plan or procedure to obtain a given end result; a recipe.","synonyms":[],"antonyms":[]},{"definition":"Circumscription; restraint; limitation.","synonyms":[],"antonyms":[]}],"synonyms":["recipe","Rx","℞","forescript"],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"(of a drug, etc.) only available with a physician or nurse practitioner's written prescription","synonyms":[],"antonyms":[],"example":"Many powerful pain killers are prescription drugs in the U.S."}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/prescription"]}]}