{"word":"warranty","rank":17946,"occurrence":0.0000545,"records":[{"word":"warranty","phonetic":"/ˈwɒ.ɹən.ti/","phonetics":[{"text":"/ˈwɒ.ɹən.ti/","audio":""},{"text":"/ˈwɔɹ.ən.ti/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A guarantee that a certain outcome or obligation will be fulfilled; security.","synonyms":[],"antonyms":[]},{"definition":"An obsolete legal agreement that was a real covenant and ran with the land, whereby the grantor and his heirs of a piece of real estate held in freehold were required to officially guarantee their claim and plead one’s case for the title. If evicted by someone with a superior claim (paramount title) they were also required to hand over other real estate of equal value in recompense. It has now been replaced by personal covenants and the covenant of warranty.","synonyms":[],"antonyms":[]},{"definition":"A legal agreement, either written or oral (an expressed warranty) or implied through the actions of the buyer and seller (an implied warranty), which states that the goods or property in question will be in exactly the same state as promised, such as in a sale of an item or piece of real estate.","synonyms":[],"antonyms":[]},{"definition":"A written guarantee, usually over a fixed period, provided to someone who buys a product or item, which states that repairs will be provided free of charge in case of damage or a fault.","synonyms":[],"antonyms":[],"example":"I made sure to check the terms of my warranty for my computer to ensure I was covered in case it broke down."},{"definition":"(insurance law) A stipulation of an insurance policy made by an insuree, guaranteeing that the facts of the policy are true and the insurance risk is as stated, which if not fulfilled renders the policy void.","synonyms":[],"antonyms":[]},{"definition":"Justification or mandate to do something, especially in terms of one’s personal conduct.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To warrant; to guarantee.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/warranty"]}]}