{"word":"lead","rank":955,"occurrence":0.0079418,"records":[{"word":"lead","phonetic":"/lɛd/","phonetics":[{"text":"/lɛd/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/lead-1-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=876671","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A heavy, pliable, inelastic metal element, having a bright, bluish color, but easily tarnished; both malleable and ductile, though with little tenacity. It is easily fusible, forms alloys with other metals, and is an ingredient of solder and type metal. Atomic number 82, symbol Pb (from Latin plumbum).","synonyms":[],"antonyms":[]},{"definition":"A plummet or mass of lead attached to a line, used in sounding depth at sea or to estimate velocity in knots.","synonyms":[],"antonyms":[]},{"definition":"A thin strip of type metal, used to separate lines of type in printing.","synonyms":[],"antonyms":[]},{"definition":"Vertical space in advance of a row or between rows of text. Also known as leading.","synonyms":[],"antonyms":[],"example":"This copy has too much lead; I prefer less space between the lines."},{"definition":"Sheets or plates of lead used as a covering for roofs.","synonyms":[],"antonyms":[]},{"definition":"(plural leads) A roof covered with lead sheets or terne plates.","synonyms":[],"antonyms":[]},{"definition":"A thin cylinder of black lead or plumbago (graphite) used in pencils.","synonyms":[],"antonyms":[]},{"definition":"Bullets; ammunition.","synonyms":[],"antonyms":[],"example":"They pumped him full of lead."}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To cover, fill, or affect with lead","synonyms":[],"antonyms":[],"example":"continuous firing leads the grooves of a rifle."},{"definition":"To place leads between the lines of.","synonyms":[],"antonyms":[],"example":"leaded matter"}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/lead"]},{"word":"lead","phonetic":"/liːd/","phonetics":[{"text":"/liːd/","audio":""},{"text":"/lid/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/lead-2-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=876670","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The act of leading or conducting; guidance; direction, course","synonyms":[],"antonyms":[],"example":"to be under the lead of another"},{"definition":"Precedence; advance position; also, the measure of precedence; the state of being ahead in a race; the highest score in a game in an incomplete game.","synonyms":[],"antonyms":[],"example":"She lost the lead."},{"definition":"An insulated metallic wire for electrical devices and equipment.","synonyms":[],"antonyms":[]},{"definition":"The situation where a runner steps away from a base while waiting for the pitch to be thrown.","synonyms":[],"antonyms":[],"example":"The runner took his lead from first."},{"definition":"The act or right of playing first in a game or round; the card suit, or piece, so played","synonyms":[],"antonyms":[],"example":"your partner has the lead"},{"definition":"The main role in a play or film; the lead role.","synonyms":[],"antonyms":[]},{"definition":"The actor who plays the main role; lead actor.","synonyms":[],"antonyms":[]},{"definition":"A channel of open water in an ice field.","synonyms":[],"antonyms":[]},{"definition":"A lode.","synonyms":[],"antonyms":[]},{"definition":"The course of a rope from end to end.","synonyms":[],"antonyms":[]},{"definition":"A rope, leather strap, or similar device with which to lead an animal; a leash","synonyms":[],"antonyms":[]},{"definition":"In a steam engine, the width of port opening which is uncovered by the valve, for the admission or release of steam, at the instant when the piston is at end of its stroke.","synonyms":[],"antonyms":[],"example":"Usage note: When used alone it means outside lead, or lead for the admission of steam. Inside lead refers to the release or exhaust."},{"definition":"Charging lead.","synonyms":[],"antonyms":[]},{"definition":"The distance of haul, as from a cutting to an embankment.","synonyms":[],"antonyms":[]},{"definition":"The action of a tooth, such as a tooth of a wheel, in impelling another tooth or a pallet.","synonyms":[],"antonyms":[]},{"definition":"Hypothesis that has not been pursued","synonyms":[],"antonyms":[],"example":"The investigation stalled when all leads turned out to be dead ends."},{"definition":"Information obtained by a detective or police officer that allows him or her to discover further details about a crime or incident.","synonyms":[],"antonyms":[],"example":"The police have a couple of leads they will follow to solve the case."},{"definition":"Potential opportunity for a sale or transaction, a potential customer.","synonyms":[],"antonyms":[],"example":"Joe is a great addition to our sales team, he has numerous leads in the paper industry."},{"definition":"Information obtained by a news reporter about an issue or subject that allows him or her to discover more details.","synonyms":[],"antonyms":[]},{"definition":"The player who throws the first two rocks for a team.","synonyms":[],"antonyms":[]},{"definition":"(newspapers) A teaser; a lead-in; the start of a newspaper column, telling who, what, when, where, why and how. (Sometimes spelled as lede for this usage to avoid ambiguity.)","synonyms":[],"antonyms":[]},{"definition":"An important news story that appears on the front page of a newspaper or at the beginning of a news broadcast","synonyms":[],"antonyms":[]},{"definition":"The axial distance a screw thread travels in one revolution. It is equal to the pitch times the number of starts.","synonyms":[],"antonyms":[]},{"definition":"In a barbershop quartet, the person who sings the melody, usually the second tenor","synonyms":[],"antonyms":[]},{"definition":"The announcement by one voice part of a theme to be repeated by the other parts.","synonyms":[],"antonyms":[]},{"definition":"A mark or a short passage in one voice part, as of a canon, serving as a cue for the entrance of others.","synonyms":[],"antonyms":[]},{"definition":"The excess above a right angle in the angle between two consecutive cranks, as of a compound engine, on the same shaft.","synonyms":[],"antonyms":[]},{"definition":"The angle between the line joining the brushes of a continuous-current dynamo and the diameter symmetrical between the poles.","synonyms":[],"antonyms":[]},{"definition":"The advance of the current phase in an alternating circuit beyond that of the electromotive force producing it.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"(heading) To guide or conduct.","synonyms":[],"antonyms":[]},{"definition":"To guide or conduct, as by accompanying, going before, showing, influencing, directing with authority, etc.; to have precedence or preeminence; to be first or chief; — used in most of the senses of the transitive verb.","synonyms":[],"antonyms":[]},{"definition":"(heading) To begin, to be ahead.","synonyms":[],"antonyms":[]},{"definition":"To draw or direct by influence, whether good or bad; to prevail on; to induce; to entice; to allure","synonyms":[],"antonyms":[],"example":"to lead someone to a righteous cause"},{"definition":"To tend or reach in a certain direction, or to a certain place.","synonyms":[],"antonyms":[],"example":"the path leads to the mill;  gambling leads to other vices"},{"definition":"To produce (with to).","synonyms":[],"antonyms":[],"example":"The shock led to a change in his behaviour."},{"definition":"(transitive) To live or experience (a particular way of life).","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"Foremost.","synonyms":["first","front","head","leader","leading"],"antonyms":[],"example":"The contestants are all tied; no one has the lead position."},{"definition":"Main, principal","synonyms":[],"antonyms":[],"example":"lead trumpet"}],"synonyms":["first","front","head","leader","leading"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/lead"]}]}