{"word":"manhood","rank":4705,"occurrence":0.0013257,"records":[{"word":"manhood","phonetic":"/ˈmænhʊd/","phonetics":[{"text":"/ˈmænhʊd/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The state or condition of being a human being","synonyms":["humanity"],"antonyms":[],"example":"He feared the speedy decline of all manhood."},{"definition":"The state or condition of being an adult male human being, as distinguished from a child or a woman. Compare adulthood. Contrast womanhood and childhood.","synonyms":[],"antonyms":[],"example":"He was a strapping youth poised on the brink of manhood."},{"definition":"All of the adult male human beingss of a given locality, region, district, country, nation or state, or all of the adult male humans pertaining to a given human subgroup (culture, race, ethnicity, lineage, family, etc.), regarded collectively","synonyms":["mankind"],"antonyms":["womanhood","womankind"]},{"definition":"The idealized nature of an adult male human: all of the characteristics traditionally and ideally ascribed to manliness, such as: courage, bravery, dominance, resolve, self-control, executive ability, physical/bodily strength, and sexual potency as regarded collectively","synonyms":["manfulness","manliness","mannishness"],"antonyms":["womanhood","womanishness","womanliness"],"example":"My goodness, James certainly is a prime example of manhood, isn't he?"},{"definition":"The self-concept of a man (an adult male human being) with respect to his possession of the various qualities traditionally and ideally ascribed to manliness; a man's sense or view of himself as being more or less manly","synonyms":[],"antonyms":["womanhood"],"example":"I feel that when you boss me around, you insult my manhood."},{"definition":"The male genitalia, especially the penis","synonyms":["junk"],"antonyms":["womanhood"],"example":"She spied on him in the shower and glimpsed his manhood."}],"synonyms":["humanity","junk","manfulness","manliness","mannishness","mankind"],"antonyms":["womanhood","womanhood","womanhood","womanishness","womanliness","womanhood","womankind"]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/manhood"]}]}