{"word":"domain","rank":934,"occurrence":0.0081056,"records":[{"word":"domain","phonetic":"/dəʊˈmeɪn/","phonetics":[{"text":"/dəʊˈmeɪn/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/domain-uk.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=1243829","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}},{"text":"/doʊˈmeɪn/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A geographic area owned or controlled by a single person or organization.","synonyms":[],"antonyms":[],"example":"The king ruled his domain harshly."},{"definition":"A field or sphere of activity, influence or expertise.","synonyms":[],"antonyms":[],"example":"Dealing with complaints isn't really my domain: get in touch with customer services."},{"definition":"A group of related items, topics, or subjects.","synonyms":[],"antonyms":[]},{"definition":"The set of all possible mathematical entities (points) where a given function is defined.","synonyms":[],"antonyms":[]},{"definition":"The set of input (argument) values for which a function is defined.","synonyms":[],"antonyms":[]},{"definition":"A ring with no zero divisors; that is, in which no product of nonzero elements is zero.","synonyms":[],"antonyms":[]},{"definition":"An open and connected set in some topology. For example, the interval (0,1) as a subset of the real numbers.","synonyms":[],"antonyms":[]},{"definition":"Any DNS domain name, particularly one which has been delegated and has become representative of the delegated domain name and its subdomains.","synonyms":[],"antonyms":[]},{"definition":"A collection of DNS or DNS-like domain names consisting of a delegated domain name and all its subdomains.","synonyms":[],"antonyms":[]},{"definition":"A collection of information having to do with a domain, the computers named in the domain, and the network on which the computers named in the domain reside.","synonyms":[],"antonyms":[]},{"definition":"The collection of computers identified by a domain's domain names.","synonyms":[],"antonyms":[]},{"definition":"A small region of a magnetic material with a consistent magnetization direction.","synonyms":[],"antonyms":[]},{"definition":"Such a region used as a data storage element in a bubble memory.","synonyms":[],"antonyms":[]},{"definition":"(data processing) A form of technical metadata that represent the type of a data item, its characteristics, name, and usage.","synonyms":[],"antonyms":[]},{"definition":"The highest rank in the classification of organisms, above kingdom; in the three-domain system, one of the taxa Bacteria, Archaea, or Eukaryota.","synonyms":[],"antonyms":[]},{"definition":"A folded section of a protein molecule that has a discrete function; the equivalent section of a chromosome","synonyms":[],"antonyms":[]}],"synonyms":["domain name","hostname","demesne","domain of definition"],"antonyms":["codomain","range"]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/domain"]}]}