{"word":"credit","rank":1605,"occurrence":0.0049262,"records":[{"word":"credit","phonetic":"/ˈkɹɛdɪt/","phonetics":[{"text":"/ˈkɹɛdɪt/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/credit-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=840678","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Reliance on the truth of something said or done; faith; trust.","synonyms":[],"antonyms":[]},{"definition":"Recognition and respect.","synonyms":[],"antonyms":[],"example":"He arrived five minutes late, but to his credit he did work an extra ten minutes at the end of his shift."},{"definition":"Acknowledgement of a contribution, especially in the performing arts.","synonyms":[],"antonyms":[],"example":"She received a singing credit in last year's operetta."},{"definition":"(television/film, usually in the plural) Written titles and other information about the TV program or movie shown at the beginning and/or end of the TV program or movie.","synonyms":[],"antonyms":[],"example":"They kissed, and then the credits rolled."},{"definition":"A privilege of delayed payment extended to a buyer or borrower on the seller's or lender's belief that what is given will be repaid.","synonyms":[],"antonyms":[],"example":"In view of your payment record, we are happy to extend further credit to you."},{"definition":"The time given for payment for something sold on trust.","synonyms":[],"antonyms":[],"example":"a long credit or a short credit"},{"definition":"A person's credit rating or creditworthiness, as represented by their history of borrowing and repayment (or non payment).","synonyms":[],"antonyms":[],"example":"What do you mean my credit is no good?"},{"definition":"An addition to certain accounts; the side of an account on which payments received are entered.","synonyms":[],"antonyms":[]},{"definition":"(tax accounting) A reduction in taxes owed, or a refund for excess taxes paid.","synonyms":[],"antonyms":[],"example":"Didn't you know that the IRS will refund any excess payroll taxes that you paid if you use the 45(B) general business credit?"},{"definition":"A source of value, distinction or honour.","synonyms":[],"antonyms":[],"example":"That engineer is a credit to the team."},{"definition":"An arbitrary unit of value, used in many token economies.","synonyms":[],"antonyms":[],"example":"To repair your star cruiser will cost 100,000 credits."},{"definition":"Recognition for having taken a course (class).","synonyms":[],"antonyms":[],"example":"If you do not come to class, you will not get credit for the class, regardless of how well you do on the final."},{"definition":"A course credit, a credit hour – used as measure if enough courses have been taken for graduation.","synonyms":[],"antonyms":[],"example":"Dude, I just need 3 more credits to graduate – I can take socio-linguistics of Swahili if I want."}],"synonyms":["unit"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To believe; to put credence in.","synonyms":["accept","believe"],"antonyms":[],"example":"Someone said there were over 100,000 people there, but I can't credit that."},{"definition":"To add to an account.","synonyms":[],"antonyms":["debit"],"example":"Credit accounts receivable with the amount of the invoice."},{"definition":"To acknowledge the contribution of.","synonyms":[],"antonyms":[],"example":"Credit the point guard with another assist."},{"definition":"To bring honour or repute upon; to do credit to; to raise the estimation of.","synonyms":[],"antonyms":[]}],"synonyms":["accept","believe"],"antonyms":["debit"]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/credit"]}]}