{"word":"breakdown","rank":13778,"occurrence":0.0001371,"records":[{"word":"breakdown","phonetic":"/ˈbɹeɪkdaʊn/","phonetics":[{"text":"/ˈbɹeɪkdaʊn/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A failure, particularly mechanical; something that has failed","synonyms":[],"antonyms":[],"example":"We saw a breakdown by the side of the road."},{"definition":"A physical collapse or lapse of mental stability","synonyms":[],"antonyms":[],"example":"After so much stress, he suffered a breakdown and simply gave up."},{"definition":"Listing, division or categorization in great detail","synonyms":[],"antonyms":[],"example":"Looking at the breakdown of the budget, I see a few items we could cut."},{"definition":"A detailed description of a forthcoming project, including the characters and roles required.","synonyms":[],"antonyms":[]},{"definition":"Breaking of chemical bonds within a compound to produce simpler compounds or elements.","synonyms":[],"antonyms":[]},{"definition":"A musical technique by which the music is stripped down, becoming simpler, varying in heaviness depending on the genre.","synonyms":[],"antonyms":[]},{"definition":"A loss of organization (of the parts of a system).","synonyms":[],"antonyms":[]},{"definition":"A noisy, rapid, shuffling dance engaged in competitively by a number of persons or pairs in succession, common in Southern United States African American music.","synonyms":[],"antonyms":[]},{"definition":"Any crude, noisy dance performed by shuffling the feet, usually by one person at a time.","synonyms":[],"antonyms":[]},{"definition":"Any rapid bluegrass dance tune, especially featuring a five-string banjo.","synonyms":[],"antonyms":[],"example":"\"Foggy Mountain Breakdown\""},{"definition":"The percussion break of songs chosen by a DJ for use in hip-hop music.","synonyms":[],"antonyms":[]}],"synonyms":["degradation"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/breakdown"]}]}