{"word":"vested","rank":9169,"occurrence":0.0004002,"records":[{"word":"vested","phonetics":[],"meanings":[{"partOfSpeech":"verb","definitions":[{"definition":"To clothe with, or as with, a vestment, or garment; to dress; to robe; to cover, surround, or encompass closely.","synonyms":[],"antonyms":[]},{"definition":"To clothe with authority, power, etc.; to put in possession; to invest; to furnish; to endow; followed by with and the thing conferred.","synonyms":[],"antonyms":[],"example":"to vest a court with power to try cases of life and death"},{"definition":"To place or give into the possession or discretion of some person or authority; to commit to another; with in before the possessor.","synonyms":[],"antonyms":[],"example":"The power of life and death is vested in the king, or in the courts."},{"definition":"To invest; to put.","synonyms":[],"antonyms":[],"example":"to vest money in goods, land, or houses"},{"definition":"To clothe with possession; also, to give a person an immediate fixed right of present or future enjoyment of.","synonyms":[],"antonyms":[],"example":"an estate is vested in possession"},{"definition":"(of an inheritance or a trust fund) To devolve upon the person currently entitled when a prior interest has ended.","synonyms":[],"antonyms":[],"example":"Upon the death of the Sovereign the Crown automatically vests in the next heir without the need of coronation or other formality."},{"definition":"(financial) To become vested, to become permanent.","synonyms":[],"antonyms":[],"example":"My pension vests at the end of the month and then I can take it with me when I quit."}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"Settled, fixed or absolute, with no contingencies.","synonyms":[],"antonyms":[]},{"definition":"Dressed or clothed, especially in vestments.","synonyms":[],"antonyms":[],"example":"The Pope, vested in mitre and cope, is greeted by a newly created Cardinal."}],"synonyms":["clad","raimented"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/vest","https://en.wiktionary.org/wiki/vested"]}]}