{"word":"type","rank":1847,"occurrence":0.0042657,"records":[{"word":"type","phonetic":"/taɪp/","phonetics":[{"text":"/taɪp/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/type-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=1676887","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A grouping based on shared characteristics; a class.","synonyms":[],"antonyms":[],"example":"This type of plane can handle rough weather more easily than that type of plane."},{"definition":"An individual considered typical of its class, one regarded as typifying a certain profession, environment, etc.","synonyms":[],"antonyms":[]},{"definition":"An individual that represents the ideal for its class; an embodiment.","synonyms":[],"antonyms":[]},{"definition":"A letter or character used for printing, historically a cast or engraved block.","synonyms":[],"antonyms":[]},{"definition":"Something, often a specimen, selected as an objective anchor to connect a scientific name to a taxon; this need not be representative or typical.","synonyms":[],"antonyms":[]},{"definition":"Preferred sort of person; sort of person that one is attracted to.","synonyms":[],"antonyms":[],"example":"He was exactly her type."},{"definition":"A blood group.","synonyms":[],"antonyms":[]},{"definition":"(corpus linguistics) A word that occurs in a text or corpus irrespective of how many times it occurs, as opposed to a token.","synonyms":[],"antonyms":[]},{"definition":"An event or person that prefigures or foreshadows a later event - commonly an Old Testament event linked to Christian times.","synonyms":[],"antonyms":[]},{"definition":"A tag attached to variables and values used in determining which kinds of value can be used in which situations; a data type.","synonyms":[],"antonyms":[]},{"definition":"The original object, or class of objects, scene, face, or conception, which becomes the subject of a copy; especially, the design on the face of a medal or a coin.","synonyms":[],"antonyms":[]},{"definition":"A simple compound, used as a mode or pattern to which other compounds are conveniently regarded as being related, and from which they may be actually or theoretically derived.","synonyms":[],"antonyms":[],"example":"The fundamental types used to express the simplest and most essential chemical relations are hydrochloric acid, water, ammonia, and methane."},{"definition":"A part of the partition of the object domain of a logical theory (which due to the existence of such partition, would be called a typed theory). (Note: this corresponds to the notion of \"data type\" in computing theory.)","synonyms":[],"antonyms":[],"example":"Categorial grammar is like a combination of context-free grammar and types."}],"synonyms":["data type","category","class","genre","group","kind","nature","sort","stripe","tribe","sort","sort"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To put text on paper using a typewriter.","synonyms":[],"antonyms":[]},{"definition":"To enter text or commands into a computer using a keyboard.","synonyms":[],"antonyms":[]},{"definition":"To determine the blood type of.","synonyms":[],"antonyms":[],"example":"The doctor ordered the lab to type the patient for a blood transfusion."},{"definition":"To represent by a type, model, or symbol beforehand; to prefigure.","synonyms":[],"antonyms":[]},{"definition":"To furnish an expression or copy of; to represent; to typify.","synonyms":[],"antonyms":[]},{"definition":"To categorize into types.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/type"]}]}