{"word":"tumbler","rank":10795,"occurrence":0.0002642,"records":[{"word":"tumbler","phonetic":"/ˈtʌmblɚ/","phonetics":[{"text":"/ˈtʌmblɚ/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/tumbler-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=49896653","license":{"name":"BY-SA 4.0","url":"https://creativecommons.org/licenses/by-sa/4.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"One who tumbles; one who plays tricks by various motions of the body; an acrobat.","synonyms":[],"antonyms":[]},{"definition":"A movable obstruction in a lock, consisting of a lever, latch, wheel, slide, or the like, which must be adjusted to a particular position by a key or other means before the bolt can be thrown in locking or unlocking.","synonyms":[],"antonyms":[]},{"definition":"A rotating device for smoothing and polishing rough objects, placed inside it, on relatively small parts.","synonyms":[],"antonyms":[]},{"definition":"A piece attached to, or forming part of, the hammer of a gunlock, upon which the mainspring acts and in which are the notches for sear point to enter.","synonyms":[],"antonyms":[]},{"definition":"A drinking glass that has no stem, foot, or handle — so called because such glasses originally had a pointed or convex base and could not be set down without spilling. This compelled the drinker to finish his measure.","synonyms":[],"antonyms":[]},{"definition":"A variety of the domestic pigeon remarkable for its habit of tumbling, or turning somersaults, during its flight.","synonyms":[],"antonyms":[]},{"definition":"A beverage cup, typically made of stainless steel, that is broad at the top and narrow at the bottom commonly used in India.","synonyms":[],"antonyms":[]},{"definition":"A dog of a breed that tumbles when pursuing game, formerly used in hunting rabbits.","synonyms":[],"antonyms":[]},{"definition":"A kind of cart; a tumbril.","synonyms":[],"antonyms":[]},{"definition":"The pupa of a mosquito.","synonyms":[],"antonyms":[]},{"definition":"One of a set of levers from which the heddles hang in some looms.","synonyms":[],"antonyms":[]},{"definition":"A porpoise.","synonyms":[],"antonyms":[]},{"definition":"(cryptocurrency) A service that mixes potentially identifiable or 'tainted' cryptocurrency funds with others, so as to obscure the audit trail.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/tumbler"]}]}