{"word":"pockets","rank":3811,"occurrence":0.001756,"records":[{"word":"pockets","phonetic":"/ˈpɒkɪts/","phonetics":[{"text":"/ˈpɒkɪts/","audio":""},{"text":"/ˈpɑkɪts/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pockets-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=2423300","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A bag stitched to an item of clothing, used for carrying small items.","synonyms":[],"antonyms":[]},{"definition":"Such a receptacle seen as housing someone's money; hence, financial resources.","synonyms":[],"antonyms":[],"example":"I paid for it out of my own pocket."},{"definition":"An indention and cavity with a net sack or similar structure (into which the balls are to be struck) at each corner and one centered on each side of a pool or snooker table.","synonyms":[],"antonyms":[]},{"definition":"An enclosed volume of one substance surrounded by another.","synonyms":[],"antonyms":[],"example":"The drilling expedition discovered a pocket of natural gas."},{"definition":"An area of land surrounded by a loop of a river.","synonyms":[],"antonyms":[]},{"definition":"The area of the field to the side of the goal posts (four pockets in total on the field, one to each side of the goals at each end of the ground). The pocket is only a roughly defined area, extending from the behind post, at an angle, to perhaps about 30 meters out.","synonyms":[],"antonyms":[]},{"definition":"The region directly behind the offensive line in which the quarterback executes plays.","synonyms":[],"antonyms":[]},{"definition":"An area where military units are completely surrounded by enemy units.","synonyms":[],"antonyms":[]},{"definition":"The position held by a second defensive middle, where an advanced middle must retreat after making a touch on the attacking middle.","synonyms":[],"antonyms":[]},{"definition":"A large bag or sack formerly used for packing various articles, such as ginger, hops, or cowries; the pocket of wool held about 168 pounds.","synonyms":[],"antonyms":[]},{"definition":"A hole or space covered by a movable piece of board, as in a floor, boxing, partitions, etc.","synonyms":[],"antonyms":[]},{"definition":"A cavity in a rock containing a nugget of gold, or other mineral; a small body of ore contained in such a cavity.","synonyms":[],"antonyms":[]},{"definition":"A strip of canvas sewn upon a sail so that a batten or a light spar can placed in the interspace.","synonyms":[],"antonyms":[]},{"definition":"The pouch of an animal.","synonyms":[],"antonyms":[]},{"definition":"The ideal point where the pins are hit by the bowling ball.","synonyms":[],"antonyms":[]},{"definition":"A socket for receiving the base of a post, stake, etc.","synonyms":[],"antonyms":[]},{"definition":"A bight on a lee shore.","synonyms":[],"antonyms":[]},{"definition":"A small space between a tooth and the adjoining gum, formed by an abnormal separation of the two.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To put (something) into a pocket.","synonyms":[],"antonyms":[]},{"definition":"To cause a ball to go into one of the pockets of the table; to complete a shot.","synonyms":[],"antonyms":[]},{"definition":"To take and keep (something, especially money that is not one's own).","synonyms":[],"antonyms":[],"example":"Record executives pocketed most of the young singer's earnings."},{"definition":"To shoplift; to steal.","synonyms":[],"antonyms":[],"example":"The thief was caught on camera pocketing the diamond."},{"definition":"To put up with; to bear without complaint.","synonyms":[],"antonyms":[]}],"synonyms":["pot","trouser"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/pocket","https://en.wiktionary.org/wiki/pockets"]}]}