{"word":"shell","rank":3330,"occurrence":0.0020981,"records":[{"word":"shell","phonetic":"/ʃɛl/","phonetics":[{"text":"/ʃɛl/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/shell-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=2100850","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A hard external covering of an animal.","synonyms":[],"antonyms":[]},{"definition":"The hard calcareous covering of a bird egg.","synonyms":[],"antonyms":[]},{"definition":"One of the outer layers of skin of an onion.","synonyms":[],"antonyms":[],"example":"The restaurant served caramelized onion shells."},{"definition":"The hard external covering of various plant seed forms.","synonyms":[],"antonyms":[]},{"definition":"The accreted mineral formed around a hollow geode.","synonyms":[],"antonyms":[]},{"definition":"The casing of a self-contained single-unit artillery projectile.","synonyms":[],"antonyms":[]},{"definition":"A hollow, usually spherical or cylindrical projectile fired from a siege mortar or a smoothbore cannon. It contains an explosive substance designed to be ignited by a fuse or by percussion at the target site so that it will burst and scattered at high velocity its contents and fragments. Formerly called a bomb.","synonyms":[],"antonyms":[]},{"definition":"The cartridge of a breechloading firearm; a load; a bullet; a round.","synonyms":[],"antonyms":[]},{"definition":"Any slight hollow structure; a framework, or exterior structure, regarded as not complete or filled in, as the shell of a house.","synonyms":[],"antonyms":[]},{"definition":"A garment, usually worn by women, such as a shirt, blouse, or top, with short sleeves or no sleeves, that often fastens in the rear.","synonyms":[],"antonyms":[]},{"definition":"A coarse or flimsy coffin; a thin interior coffin enclosed within a more substantial one.","synonyms":[],"antonyms":[]},{"definition":"A string instrument, as a lyre, whose acoustical chamber is formed like a shell.","synonyms":[],"antonyms":[],"example":"The first lyre may have been made by drawing strings over the underside of a tortoise shell."},{"definition":"The body of a drum; the often wooden, often cylindrical acoustic chamber, with or without rims added for tuning and for attaching the drum head.","synonyms":[],"antonyms":[]},{"definition":"An engraved copper roller used in print works.","synonyms":[],"antonyms":[]},{"definition":"The thin coating of copper on an electrotype.","synonyms":[],"antonyms":[]},{"definition":"The watertight outer covering of the hull of a vessel, often made with planking or metal plating.","synonyms":[],"antonyms":[]},{"definition":"(rigging) The outer frame or case of a block within which the sheaves revolve.","synonyms":[],"antonyms":[]},{"definition":"A light boat whose frame is covered with thin wood, impermeable fabric, or water-proofed paper; a racing shell or dragon boat.","synonyms":[],"antonyms":[]},{"definition":"A set of atomic orbitals that have the same principal quantum number.","synonyms":[],"antonyms":[]},{"definition":"The outward form independent of what is inside.","synonyms":[],"antonyms":[]},{"definition":"The empty outward form of someone or something.","synonyms":[],"antonyms":[],"example":"The setback left him a mere shell; he was never the same again."},{"definition":"An emaciated person.","synonyms":[],"antonyms":[],"example":"He's lost so much weight from illness; he's a shell of his former self."},{"definition":"A psychological barrier to social interaction.","synonyms":[],"antonyms":[],"example":"Even after months of therapy he's still in his shell."},{"definition":"An operating system software user interface, whose primary purpose is to launch other programs and control their interactions; the user's command interpreter. Shell is a way to separate the internal complexity of the implementation of the command from the user. The internals can change while the user experience/interface remains the same.","synonyms":[],"antonyms":[],"example":"The name \"Bash\" is an acronym which stands for \"Bourne-again shell\", itself a pun on the name of the \"Bourne shell\", an earlier Unix shell designed by Stephen Bourne, and the Christian concept of being \"born again\"."},{"definition":"A legal entity that has no operations.","synonyms":[],"antonyms":[],"example":"A shell corporation was formed to acquire the old factory."},{"definition":"A concave rough cast-iron tool in which a convex lens is ground to shape.","synonyms":[],"antonyms":[]},{"definition":"A gouge bit or shell bit.","synonyms":[],"antonyms":[]},{"definition":"The onset and coda of a syllable.","synonyms":[],"antonyms":[]},{"definition":"A person's ear.","synonyms":["shell-like"],"antonyms":[],"example":"Can I have a quick word in your shell?"}],"synonyms":["shell-like"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To remove the outer covering or shell of something.","synonyms":[],"antonyms":[]},{"definition":"To bombard, to fire projectiles at, especially with artillery.","synonyms":[],"antonyms":[]},{"definition":"To disburse or give up money, to pay. (Often used with out).","synonyms":[],"antonyms":[]},{"definition":"To fall off, as a shell, crust, etc.","synonyms":[],"antonyms":[]},{"definition":"To cast the shell, or exterior covering; to fall out of the pod or husk.","synonyms":[],"antonyms":[],"example":"Nuts shell in falling."},{"definition":"To switch to a shell or command line.","synonyms":[],"antonyms":[]},{"definition":"To form shallow, irregular cracks (in a coating).","synonyms":[],"antonyms":[]},{"definition":"To form a shelling.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/shell"]}]}