{"word":"territories","rank":6846,"occurrence":0.0007342,"records":[{"word":"territories","phonetic":"/ˈtɛɹɪt(ə)ɹiz/","phonetics":[{"text":"/ˈtɛɹɪt(ə)ɹiz/","audio":""},{"text":"/ˈtɛɹɪˌtɔɹiz/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/territories-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=2454341","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A large extent or tract of land; for example a region, country or district.","synonyms":[],"antonyms":[]},{"definition":"One of three of Canada's federated entities, located in the country's Arctic, with fewer powers than a province and created by an act of Parliament rather than by the Constitution: Yukon, Northwest Territories, and Nunavut.","synonyms":[],"antonyms":[]},{"definition":"One of three of Australia's federated entities, located in the country's north and southeast, with fewer powers than a state and created by an act of Parliament rather than by the Constitution: Northern Territory, Australian Capital Territory and Jervis Bay Territory.","synonyms":[],"antonyms":[]},{"definition":"A geographic area under control of a single governing entity such as state or municipality; an area whose borders are determined by the scope of political power rather than solely by natural features such as rivers and ridges.","synonyms":[],"antonyms":[]},{"definition":"An area that an animal of a particular species consistently defends against its conspecifics.","synonyms":[],"antonyms":[]},{"definition":"The part of the playing field or board over which a player or team has control.","synonyms":[],"antonyms":[]},{"definition":"A geographic area that a person or organization is responsible for in the course of work.","synonyms":[],"antonyms":[]},{"definition":"A location or logical space which someone owns or controls.","synonyms":[],"antonyms":[]},{"definition":"A market segment or scope of professional practice over which an organization or type of practitioner has exclusive rights.","synonyms":[],"antonyms":[]},{"definition":"An area of subject matter, knowledge, or experience.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/territories","https://en.wiktionary.org/wiki/territory"]}]}