{"word":"clearing","rank":5145,"occurrence":0.001173,"records":[{"word":"clearing","phonetic":"/ˈklɪəɹɪŋ/","phonetics":[{"text":"/ˈklɪəɹɪŋ/","audio":""},{"text":"/ˈklɪɹɪŋ/","audio":""}],"meanings":[{"partOfSpeech":"verb","definitions":[{"definition":"To remove obstructions, impediments or other unwanted items from.","synonyms":[],"antonyms":[],"example":"If you clear the table, I'll wash up."},{"definition":"To remove (items or material) so as to leave something unobstructed or open.","synonyms":[],"antonyms":[],"example":"Please clear all this stuff off the table."},{"definition":"To become free from obstruction or obscurement; to become transparent.","synonyms":[],"antonyms":[],"example":"After a heavy rain, the sky cleared nicely for the evening."},{"definition":"To eliminate ambiguity or doubt from (a matter); to clarify or resolve; to clear up.","synonyms":[],"antonyms":[],"example":"We need to clear this issue once and for all."},{"definition":"To remove from suspicion, especially of having committed a crime.","synonyms":[],"antonyms":[],"example":"The court cleared the man of murder."},{"definition":"To pass without interference; to miss.","synonyms":[],"antonyms":[],"example":"The door just barely clears the table as it closes."},{"definition":"(activities such as jumping or throwing) To exceed a stated mark.","synonyms":[],"antonyms":[],"example":"She was the first female high jumper to clear two metres."},{"definition":"To finish or complete (a stage, challenge, or game).","synonyms":[],"antonyms":[],"example":"I cleared the first level in 36 seconds."},{"definition":"Of a check or financial transaction, to go through as payment; to be processed so that the money is transferred.","synonyms":[],"antonyms":[],"example":"The check might not clear for a couple of days."},{"definition":"To earn a profit of; to net.","synonyms":[],"antonyms":[],"example":"He's been clearing seven thousand a week."},{"definition":"To approve or authorise for a particular purpose or action; to give clearance to.","synonyms":[],"antonyms":[],"example":"Air traffic control cleared the plane to land."},{"definition":"To obtain approval or authorisation in respect of.","synonyms":[],"antonyms":[],"example":"I've cleared the press release with the marketing department, so go ahead and publish it."},{"definition":"To obtain a clearance.","synonyms":[],"antonyms":[],"example":"The steamer cleared for Liverpool today."},{"definition":"To obtain permission to use (a sample of copyrighted audio) in another track.","synonyms":[],"antonyms":[]},{"definition":"To disengage oneself from incumbrances, distress, or entanglements; to become free.","synonyms":[],"antonyms":[]},{"definition":"To hit, kick, head, punch etc. (a ball, puck) away in order to defend one's goal.","synonyms":[],"antonyms":[],"example":"A low cross came in, and Smith cleared."},{"definition":"To reset or unset; to return to an empty state or to zero.","synonyms":[],"antonyms":[],"example":"to clear an array;  to clear a single bit (binary digit) in a value"},{"definition":"To style (an element within a document) so that it is not permitted to float at a given position.","synonyms":[],"antonyms":[]}],"synonyms":["stub"],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"The act or process of making or becoming clear.","synonyms":[],"antonyms":[]},{"definition":"An area of land within a wood or forest devoid of trees.","synonyms":[],"antonyms":[]},{"definition":"An open space in the fog etc.","synonyms":[],"antonyms":[]},{"definition":"A process of exchanging transaction information and authorisation through a central institution or system to complete and settle those transactions.","synonyms":[],"antonyms":[]},{"definition":"A sequence of events used to disconnect a call, and return to the ready state.","synonyms":[],"antonyms":[]},{"definition":"The period in which remaining university places are allocated to remaining students.","synonyms":[],"antonyms":[]},{"definition":"The act of removing the ball from one's own goal area by kicking it.","synonyms":[],"antonyms":[]}],"synonyms":["glade"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/clear","https://en.wiktionary.org/wiki/clearing"]}]}