{"word":"bars","rank":4431,"occurrence":0.0014391,"records":[{"word":"bars","phonetic":"/ˈbɑː(ɹ)z/","phonetics":[{"text":"/ˈbɑː(ɹ)z/","audio":""},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/bars-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=2453859","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A solid, more or less rigid object of metal or wood with a uniform cross-section smaller than its length.","synonyms":[],"antonyms":[],"example":"The window was protected by steel bars."},{"definition":"A solid metal object with uniform (round, square, hexagonal, octagonal or rectangular) cross-section; in the US its smallest dimension is 1/4 inch or greater, a piece of thinner material being called a strip.","synonyms":[],"antonyms":[],"example":"Ancient Sparta used iron bars instead of handy coins in more valuable alloy, to physically discourage the use of money."},{"definition":"A cuboid piece of any solid commodity.","synonyms":[],"antonyms":[],"example":"bar of chocolate"},{"definition":"A broad shaft, or band, or stripe.","synonyms":[],"antonyms":[],"example":"a bar of colour"},{"definition":"A long, narrow drawn or printed rectangle, cuboid or cylinder, especially as used in a bar code or a bar chart.","synonyms":[],"antonyms":[]},{"definition":"Any of various lines used as punctuation or diacritics, such as the pipe ⟨|⟩, fraction bar (as in 12), and strikethrough (as in Ⱥ), formerly including oblique marks such as the slash.","synonyms":[],"antonyms":[]},{"definition":"The sign indicating that the characteristic of a logarithm is negative, conventionally placed above the digit(s) to show that it applies to the characteristic only and not to the mantissa.","synonyms":[],"antonyms":[]},{"definition":"A similar sign indicating that the charge on a particle is negative (and that consequently the particle is in fact an antiparticle).","synonyms":[],"antonyms":[]},{"definition":"A business licensed to sell alcoholic drinks for consumption on the premises, or the premises themselves; public house.","synonyms":["barroom","ginshop","pub","public house","tavern"],"antonyms":[],"example":"The street was lined with all-night bars."},{"definition":"The counter of such premises.","synonyms":[],"antonyms":[],"example":"Step up to the bar and order a drink."},{"definition":"A counter, or simply a cabinet, from which alcoholic drinks are served in a private house or a hotel room.","synonyms":[],"antonyms":[]},{"definition":"(by extension, in combinations such as coffee bar, juice bar etc.) Premises or a counter serving any type of beverage.","synonyms":[],"antonyms":[]},{"definition":"An establishment where alcohol and sometimes other refreshments are served.","synonyms":[],"antonyms":[]},{"definition":"An informal establishment selling food to be consumed on the premises.","synonyms":[],"antonyms":[],"example":"a burger bar"},{"definition":"An establishment offering cosmetic services.","synonyms":[],"antonyms":[],"example":"a nail bar; a brow bar"},{"definition":"An official order or pronouncement that prohibits some activity.","synonyms":["ban","prohibition"],"antonyms":[],"example":"The club has lifted its bar on women members."},{"definition":"Anything that obstructs, hinders, or prevents; an obstruction; a barrier.","synonyms":[],"antonyms":[]},{"definition":"(whimsical, derived from fubar) A metasyntactic variable representing an unspecified entity, often the second in a series, following foo.","synonyms":[],"antonyms":[],"example":"Suppose we have two objects, foo and bar."},{"definition":"(Parliament) A dividing line (physical or notional) in the chamber of a legislature beyond which only members and officials may pass.","synonyms":[],"antonyms":[]},{"definition":"The railing surrounding the part of a courtroom in which the judges, lawyers, defendants and witnesses stay","synonyms":[],"antonyms":[]},{"definition":"\"the Bar\" or \"the bar\" The bar exam, the legal licensing exam.","synonyms":[],"antonyms":[],"example":"He's studying hard to pass the Bar this time; he's failed it twice before."},{"definition":"(metonym, \"the Bar\", \"the bar\") Collectively, lawyers or the legal profession; specifically applied to barristers in some countries but including all lawyers in others.","synonyms":[],"antonyms":[],"example":"He was called to the bar, he became a barrister."},{"definition":"One of an array of bar-shaped symbols that display the level of something, such as wireless signal strength or battery life remaining.","synonyms":[],"antonyms":[],"example":"I don't have any bars in the middle of this desert."},{"definition":"A vertical line across a musical staff dividing written music into sections, typically of equal durational value.","synonyms":[],"antonyms":[]},{"definition":"One of those musical sections.","synonyms":["measure"],"antonyms":[]},{"definition":"A horizontal pole that must be crossed in high jump and pole vault","synonyms":[],"antonyms":[]},{"definition":"Any level of achievement regarded as a challenge to be overcome.","synonyms":[],"antonyms":[]},{"definition":"(most codes) The crossbar.","synonyms":[],"antonyms":[]},{"definition":"The central divider between the inner and outer table of a backgammon board, where stones are placed if they are hit.","synonyms":[],"antonyms":[]},{"definition":"An addition to a military medal, on account of a subsequent act","synonyms":[],"antonyms":[]},{"definition":"A linear shoaling landform feature within a body of water.","synonyms":[],"antonyms":[]},{"definition":"A ridge or succession of ridges of sand or other substance, especially a formation extending across the mouth of a river or harbor or off a beach, and which may obstruct navigation. (FM 55-501).","synonyms":[],"antonyms":[]},{"definition":"One of the ordinaries in heraldry; a fess.","synonyms":[],"antonyms":[]},{"definition":"A city gate, in some British place names.","synonyms":[],"antonyms":[],"example":"Potter's Bar"},{"definition":"A drilling or tamping rod.","synonyms":[],"antonyms":[]},{"definition":"A vein or dike crossing a lode.","synonyms":[],"antonyms":[]},{"definition":"A gatehouse of a castle or fortified town.","synonyms":[],"antonyms":[]},{"definition":"The part of the crust of a horse's hoof which is bent inwards towards the frog at the heel on each side, and extends into the centre of the sole.","synonyms":[],"antonyms":[]},{"definition":"(in the plural) The space between the tusks and grinders in the upper jaw of a horse, in which the bit is placed.","synonyms":[],"antonyms":[]}],"synonyms":["ban","prohibition","barroom","ginshop","pub","public house","tavern","measure"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To obstruct the passage of (someone or something).","synonyms":[],"antonyms":[],"example":"Our way was barred by a huge rockfall."},{"definition":"To prohibit.","synonyms":[],"antonyms":[],"example":"I couldn't get into the nightclub because I had been barred."},{"definition":"To lock or bolt with a bar.","synonyms":[],"antonyms":[],"example":"bar the door"},{"definition":"To imprint or paint with bars, to stripe.","synonyms":[],"antonyms":[]}],"synonyms":["block","hinder","obstruct","ban","interdict","prohibit"],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"A non-SI unit of pressure equal to 100,000 pascals, approximately equal to atmospheric pressure at sea level.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/bar","https://en.wiktionary.org/wiki/bars"]}]}