{"word":"rod","rank":4796,"occurrence":0.0012955,"records":[{"word":"rod","phonetic":"/ɹɒd/","phonetics":[{"text":"/ɹɒd/","audio":""},{"text":"/ɹɑd/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/rod-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=424790","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A straight, round stick, shaft, bar, cane, or staff.","synonyms":[],"antonyms":[]},{"definition":"A longitudinal pole used for forming part of a framework such as an awning or tent.","synonyms":[],"antonyms":[]},{"definition":"A long slender usually tapering pole used for angling; fishing rod.","synonyms":[],"antonyms":[],"example":"When I hooked a snake and not a fish, I got so scared I dropped my rod in the water."},{"definition":"A stick, pole, or bundle of switches or twigs (such as a birch), used for personal defense or to administer corporal punishment by whipping.","synonyms":[],"antonyms":[]},{"definition":"An implement resembling and/or supplanting a rod (particularly a cane) that is used for corporal punishment, and metonymically called the rod, regardless of its actual shape and composition.","synonyms":[],"antonyms":[],"example":"The judge imposed on the thief a sentence of fifteen strokes with the rod."},{"definition":"A stick used to measure distance, by using its established length or task-specific temporary marks along its length, or by dint of specific graduated marks.","synonyms":[],"antonyms":[],"example":"I notched a rod and used it to measure the length of rope to cut."},{"definition":"A unit of length equal to 1 pole, a perch, 1/4 chain, 5 1/2 yards, 16 1/2 feet, or exactly 5.0292 meters (these being all equivalent).","synonyms":[],"antonyms":[]},{"definition":"An implement held vertically and viewed through an optical surveying instrument such as a transit, used to measure distance in land surveying and construction layout; an engineer's rod, surveyor's rod, surveying rod, leveling rod, ranging rod. The modern engineer's or surveyor's rod commonly is eight or ten feet long and often designed to extend higher. In former times a surveyor's rod often was a single wooden pole or composed of multiple sectioned and socketed pieces, and besides serving as a sighting target was used to measure distance on the ground horizontally, hence for convenience was of one rod or pole in length, that is, 5 1/2 yards.","synonyms":[],"antonyms":[]},{"definition":"A unit of area equal to a square rod, 30 1/4 square yards or 1/160 acre.","synonyms":[],"antonyms":[],"example":"The house had a small yard of about six rods in size."},{"definition":"A straight bar that unites moving parts of a machine, for holding parts together as a connecting rod or for transferring power as a drive-shaft.","synonyms":[],"antonyms":[],"example":"The engine threw a rod, and then went to pieces before our eyes, springs and coils shooting in all directions."},{"definition":"A rod cell: a rod-shaped cell in the eye that is sensitive to light.","synonyms":[],"antonyms":[],"example":"The rods are more sensitive than the cones, but do not discern color."},{"definition":"Any of a number of long, slender microorganisms.","synonyms":[],"antonyms":[],"example":"He applied a gram positive stain, looking for rods indicative of Listeria."},{"definition":"A stirring rod: a glass rod, typically about 6 inches to 1 foot long and 1/8 to 1/4 inch in diameter that can be used to stir liquids in flasks or beakers.","synonyms":[],"antonyms":[]},{"definition":"A pistol; a gun.","synonyms":[],"antonyms":[]},{"definition":"A penis.","synonyms":[],"antonyms":[]},{"definition":"A hot rod, an automobile or other passenger motor vehicle modified to run faster and often with exterior cosmetic alterations, especially one based originally on a pre-1940s model or (currently) denoting any older vehicle thus modified.","synonyms":[],"antonyms":[]},{"definition":"A rod-shaped object that appears in photographs or videos traveling at high speed, not seen by the person recording the event, often associated with extraterrestrial entities.","synonyms":[],"antonyms":[]},{"definition":"A Cuisenaire rod.","synonyms":[],"antonyms":[]},{"definition":"A coupling rod or connecting rod, which links the driving wheels of a steam locomotive.","synonyms":[],"antonyms":[]}],"synonyms":["skyfish"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To reinforce concrete with metal rods.","synonyms":[],"antonyms":[]},{"definition":"To furnish with rods, especially lightning rods.","synonyms":[],"antonyms":[]},{"definition":"To penetrate sexually.","synonyms":[],"antonyms":[]},{"definition":"To hot rod.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/rod"]}]}