{"word":"offset","rank":13359,"occurrence":0.0001488,"records":[{"word":"offset","phonetic":"/ɒfˈsɛt/","phonetics":[{"text":"/ɒfˈsɛt/","audio":""},{"text":"/ɑfˈsɛt/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Anything that acts as counterbalance; a compensating equivalent.","synonyms":[],"antonyms":[],"example":"Today's victory was an offset to yesterday's defeat."},{"definition":"A form of countertrade arrangement, in which the seller agrees to purchase within a set time frame products of a certain value from the buying country. This kind of agreement may be used in large international public sector contracts such as arms sales.","synonyms":[],"antonyms":[]},{"definition":"(c. 1555) A time at which something begins; outset.","synonyms":[],"antonyms":[]},{"definition":"The offset printing process, in which ink is carried from a metal plate to a rubber blanket and from there to the printing surface.","synonyms":[],"antonyms":[],"example":"offset lithographs"},{"definition":"The difference between a target memory address and a base address.","synonyms":[],"antonyms":[],"example":"An array of bytes uses its index as the offset, of words a multiple thereof."},{"definition":"(signal analysis) The displacement between the base level of a measurement and the signal's real base level.","synonyms":[],"antonyms":[],"example":"The raw signal data was subjected to a baseline correction process to subtract the sensor's offset and drift variations."},{"definition":"The distance by which one thing is out of alignment with another.","synonyms":[],"antonyms":[],"example":"There is a small offset between the switch and the indicator which some users found confusing."},{"definition":"A short distance measured at right angles from a line actually run to some point in an irregular boundary, or to some object.","synonyms":[],"antonyms":[]},{"definition":"An abrupt bend in an object, such as a rod, by which one part is turned aside out of line, but nearly parallel, with the rest; the part thus bent aside.","synonyms":[],"antonyms":[]},{"definition":"A short prostrate shoot that takes root and produces a tuft of leaves, etc.","synonyms":[],"antonyms":[]},{"definition":"A spur from a range of hills or mountains.","synonyms":[],"antonyms":[]},{"definition":"A horizontal ledge on the face of a wall, formed by a diminution of its thickness, or by the weathering or upper surface of a part built out from it; a set-off.","synonyms":[],"antonyms":[]},{"definition":"A terrace on a hillside.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To compensate for, by applying a change in the opposite direction.","synonyms":[],"antonyms":[],"example":"I'll offset the time difference locally."},{"definition":"To form an offset in (a wall, rod, pipe, etc.).","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/offset"]}]}