{"word":"zones","rank":13022,"occurrence":0.0001602,"records":[{"word":"zones","phonetics":[],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Each of the five regions of the earth's surface into which it was divided by climatic differences, namely the torrid zone (between the tropics), two temperate zones (between the tropics and the polar circles), and two frigid zones (within the polar circles).","synonyms":[],"antonyms":[]},{"definition":"Any given region or area of the world.","synonyms":[],"antonyms":[]},{"definition":"A given area distinguished on the basis of a particular characteristic, use, restriction, etc.","synonyms":[],"antonyms":[],"example":"Files in the Internet zone are blocked by default, as a security measure."},{"definition":"A band or area of growth encircling anything.","synonyms":[],"antonyms":[],"example":"a zone of evergreens on a mountain; the zone of animal or vegetable life in the ocean around an island or a continent"},{"definition":"A band or stripe extending around a body.","synonyms":[],"antonyms":[]},{"definition":"A series of planes having mutually parallel intersections.","synonyms":[],"antonyms":[]},{"definition":"The strike zone.","synonyms":[],"antonyms":[],"example":"That pitch was low and away, just outside of the zone."},{"definition":"Every of the three parts of an ice rink, divided by two blue lines.","synonyms":[],"antonyms":[],"example":"Players are off side, if they enter the attacking zone before the puck."},{"definition":"A semicircular area in front of each goal.","synonyms":[],"antonyms":[]},{"definition":"A high-performance phase or period.","synonyms":[],"antonyms":[],"example":"I just got in the zone late in the game: everything was going in."},{"definition":"A defensive scheme where defenders guard a particular area of the court or field, as opposed to a particular opposing player.","synonyms":[],"antonyms":[]},{"definition":"That collection of a domain's DNS resource records, the domain and its subdomains, that are not delegated to another authority.","synonyms":[],"antonyms":[]},{"definition":"(Apple computing) A logical group of network devices on AppleTalk.","synonyms":[],"antonyms":[]},{"definition":"A belt or girdle.","synonyms":[],"antonyms":[]},{"definition":"The curved surface of a frustum of a sphere, the portion of surface of a sphere delimited by parallel planes.","synonyms":[],"antonyms":[]},{"definition":"(perhaps by meronymy) A frustum of a sphere.","synonyms":[],"antonyms":[]},{"definition":"A circuit; a circumference.","synonyms":[],"antonyms":[]}],"synonyms":["area","belt","district","region","section","sector","sphere","territory","crease"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To divide into or assign sections or areas.","synonyms":[],"antonyms":[],"example":"Please zone off our staging area, a section for each group."},{"definition":"To define the property use classification of an area.","synonyms":[],"antonyms":[],"example":"This area was zoned for industrial use."},{"definition":"To enter a daydream state temporarily, for instance as a result of boredom, fatigue, or intoxication; to doze off.","synonyms":[],"antonyms":[],"example":"Everyone just put their goddamn heads together and zoned. (Byron Coley, liner notes for the album \"Piece for Jetsun Dolma\" by Thurston Moore)"},{"definition":"To girdle or encircle.","synonyms":[],"antonyms":[]}],"synonyms":["doze off","zone out"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/zone","https://en.wiktionary.org/wiki/zones"]}]}