{"word":"walks","rank":2875,"occurrence":0.0025103,"records":[{"word":"walks","phonetic":"/wɑks/","phonetics":[{"text":"/wɑks/","audio":""},{"text":"/wɔːks/","audio":""},{"text":"/wɔks/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/walks-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=2100561","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"verb","definitions":[{"definition":"To move on the feet by alternately setting each foot (or pair or group of feet, in the case of animals with four or more feet) forward, with at least one foot on the ground at all times. Compare run.","synonyms":[],"antonyms":[],"example":"To walk briskly for an hour every day is to keep fit."},{"definition":"To \"walk free\", i.e. to win, or avoid, a criminal court case, particularly when actually guilty.","synonyms":[],"antonyms":[],"example":"If you can’t present a better case, that robber is going to walk."},{"definition":"Of an object, to go missing or be stolen.","synonyms":[],"antonyms":[],"example":"If you leave your wallet lying around, it’s going to walk."},{"definition":"(of a batsman) To walk off the field, as if given out, after the fielding side appeals and before the umpire has ruled; done as a matter of sportsmanship when the batsman believes he is out.","synonyms":[],"antonyms":[]},{"definition":"To travel (a distance) by walking.","synonyms":[],"antonyms":[],"example":"I walk two miles to school every day.  The museum’s not far from here – you can walk it."},{"definition":"To take for a walk or accompany on a walk.","synonyms":[],"antonyms":[],"example":"I walk the dog every morning.  Will you walk me home?"},{"definition":"To allow a batter to reach base by pitching four balls.","synonyms":[],"antonyms":[]},{"definition":"To move something by shifting between two positions, as if it were walking.","synonyms":[],"antonyms":[],"example":"I carefully walked the ladder along the wall."},{"definition":"To full; to beat cloth to give it the consistency of felt.","synonyms":[],"antonyms":[]},{"definition":"To traverse by walking (or analogous gradual movement).","synonyms":[],"antonyms":[],"example":"I walked the streets aimlessly.   Debugging this computer program involved walking the heap."},{"definition":"To operate the left and right throttles of (an aircraft) in alternation.","synonyms":[],"antonyms":[]},{"definition":"To leave, resign.","synonyms":[],"antonyms":[],"example":"If we don't offer him more money he'll walk."},{"definition":"To push (a vehicle) alongside oneself as one walks.","synonyms":[],"antonyms":[]},{"definition":"To behave; to pursue a course of life; to conduct oneself.","synonyms":[],"antonyms":[]},{"definition":"To be stirring; to be abroad; to go restlessly about; said of things or persons expected to remain quiet, such as a sleeping person, or the spirit of a dead person.","synonyms":[],"antonyms":[]},{"definition":"To be in motion; to act; to move.","synonyms":[],"antonyms":[]},{"definition":"To put, keep, or train (a puppy) in a walk, or training area for dogfighting.","synonyms":[],"antonyms":[]},{"definition":"(hotel) To move a guest to another hotel if their confirmed reservation is not available on day of check-in.","synonyms":[],"antonyms":[]}],"synonyms":["nicked","pinched","stolen","full","waulk","acquitted","get off","go free"],"antonyms":["run"]},{"partOfSpeech":"noun","definitions":[{"definition":"A trip made by walking.","synonyms":[],"antonyms":[],"example":"I take a walk every morning"},{"definition":"A distance walked.","synonyms":[],"antonyms":[],"example":"It’s a long walk from my house to the library"},{"definition":"An Olympic Games track event requiring that the heel of the leading foot touch the ground before the toe of the trailing foot leaves the ground.","synonyms":[],"antonyms":[]},{"definition":"A manner of walking; a person's style of walking.","synonyms":[],"antonyms":[],"example":"The Ministry of Silly Walks is underfunded this year"},{"definition":"A path, sidewalk/pavement or other maintained place on which to walk. Compare trail.","synonyms":[],"antonyms":[]},{"definition":"A situation where all players fold to the big blind, as their first action (instead of calling or raising), once they get their cards.","synonyms":[],"antonyms":[]},{"definition":"An award of first base to a batter following four balls being thrown by the pitcher; known in the rules as a \"base on balls\".","synonyms":[],"antonyms":[],"example":"The pitcher now has two walks in this inning alone"},{"definition":"In coffee, coconut, and other plantations, the space between them.","synonyms":[],"antonyms":[]},{"definition":"(Belize) An area of an estate planted with fruit-bearing trees.","synonyms":[],"antonyms":[]},{"definition":"A place for keeping and training puppies for dogfighting.","synonyms":[],"antonyms":[]},{"definition":"An enclosed area in which a gamecock is confined to prepare him for fighting.","synonyms":[],"antonyms":[]},{"definition":"A sequence of alternating vertices and edges, where each edge's endpoints are the preceding and following vertices in the sequence.","synonyms":[],"antonyms":[]},{"definition":"Something very easily accomplished; a walk in the park.","synonyms":[],"antonyms":[]},{"definition":"A cheque drawn on a bank that was not a member of the London Clearing and whose sort code was allocated on a one-off basis; they had to be \"walked\" (hand-delivered by messengers).","synonyms":[],"antonyms":[]}],"synonyms":["hike","trek","gait","footpath","path","pavement","sidewalk","hike","stroll","trek"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/walk","https://en.wiktionary.org/wiki/walks"]}]}