{"word":"gender","rank":13513,"occurrence":0.0001444,"records":[{"word":"gender","phonetic":"/ˈdʒɛndə/","phonetics":[{"text":"/ˈdʒɛndə/","audio":""},{"text":"/ˈdʒɛndɚ/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Class; kind.","synonyms":[],"antonyms":[]},{"definition":"(grammar) A division of nouns and pronouns (and sometimes of other parts of speech) into masculine or feminine, and sometimes other categories like neuter or common, and animate or inanimate.","synonyms":[],"antonyms":[]},{"definition":"(now sometimes proscribed) Sex (a category such as \"male\" or \"female\" into which sexually-reproducing organisms are divided on the basis of their reproductive roles in their species).","synonyms":[],"antonyms":[],"example":"The effect of the medication is dependent upon age, gender, and other factors."},{"definition":"Identification as a man, a woman or something else, and association with a (social) role or set of behavioral and cultural traits, clothing, etc; a category to which a person belongs on this basis. (Compare gender role, gender identity.)","synonyms":[],"antonyms":[]},{"definition":"(hardware) The quality which distinguishes connectors, which may be male (fitting into another connector) and female (having another connector fit into it), or genderless/androgynous (capable of fitting together with another connector of the same type).","synonyms":[],"antonyms":[]}],"synonyms":["sex","genre","voice"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To assign a gender to (a person); to perceive as having a gender; to address using terms (pronouns, nouns, adjectives...) that express a certain gender.","synonyms":[],"antonyms":[]},{"definition":"To perceive (a thing) as having characteristics associated with a certain gender, or as having been authored by someone of a certain gender.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"Sound uttered by the mouth, especially by human beings in speech or song; sound thus uttered considered as possessing some special quality or character","synonyms":[],"antonyms":[],"example":"His low voice allowed him to become a bass in the choir."},{"definition":"Sound made through vibration of the vocal cords; sonant, or intonated, utterance; tone; — distinguished from mere breath sound as heard in whispering and voiceless consonants.","synonyms":[],"antonyms":[]},{"definition":"The tone or sound emitted by an object","synonyms":[],"antonyms":[]},{"definition":"The faculty or power of utterance","synonyms":[],"antonyms":[],"example":"to cultivate the voice"},{"definition":"That which is communicated; message; meaning.","synonyms":[],"antonyms":[]},{"definition":"An expressed opinion, choice, will, desire, or wish; the right or ability to make such expression or to have it considered","synonyms":[],"antonyms":[]},{"definition":"Command; precept.","synonyms":[],"antonyms":[]},{"definition":"One who speaks; a speaker.","synonyms":[],"antonyms":[]},{"definition":"A particular style or way of writing that expresses a certain tone or feeling.","synonyms":[],"antonyms":[]},{"definition":"(grammar) A particular way of inflecting or conjugating verbs, or a particular form of a verb, by means of which is indicated the relation of the subject of the verb to the action which the verb expresses.","synonyms":[],"antonyms":[],"example":"The verbal system of Latin has two voices, active and passive."},{"definition":"In harmony, an independent vocal or instrumental part in a piece of composition.","synonyms":[],"antonyms":[],"example":"The theme of this piece constantly migrates between the three voice parts."},{"definition":"(IRC) A flag associated with a user on a channel, determining whether or not they can send messages to the channel.","synonyms":[],"antonyms":[]}],"synonyms":["say-so","steven","vote","reard","steven","diathesis","gender","grammatical voice","verbal voice"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/gender","https://en.wiktionary.org/wiki/voice"]},{"word":"gender","phonetic":"/ˈdʒɛndə/","phonetics":[{"text":"/ˈdʒɛndə/","audio":""},{"text":"/ˈdʒɛndɚ/","audio":""}],"meanings":[{"partOfSpeech":"verb","definitions":[{"definition":"To engender.","synonyms":[],"antonyms":[]},{"definition":"To breed.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/gender"]}]}