{"word":"reporting","rank":10771,"occurrence":0.0002656,"records":[{"word":"reporting","phonetics":[],"meanings":[{"partOfSpeech":"verb","definitions":[{"definition":"To relate details of (an event or incident); to recount, describe (something).","synonyms":[],"antonyms":[]},{"definition":"To repeat (something one has heard), to retell; to pass on, convey (a message, information etc.).","synonyms":[],"antonyms":[]},{"definition":"To take oneself (to someone or something) for guidance or support; to appeal.","synonyms":[],"antonyms":[]},{"definition":"To notify someone of (particular intelligence, suspicions, illegality, misconduct etc.); to make notification to relevant authorities; to submit a formal report of.","synonyms":[],"antonyms":[],"example":"For insurance reasons, I had to report the theft to the local police station."},{"definition":"To make a formal statement, especially of complaint, about (someone).","synonyms":[],"antonyms":[],"example":"If you do that again I'll report you to the boss."},{"definition":"To show up or appear at an appointed time; to present oneself.","synonyms":[],"antonyms":[]},{"definition":"To write news reports (for); to cover as a journalist or reporter.","synonyms":[],"antonyms":[],"example":"Andrew Marr reports now on more in-fighting at Westminster."},{"definition":"To be accountable to or subordinate to (someone) in a hierarchy; to receive orders from (someone); to give official updates to (someone who is above oneself in a hierarchy).","synonyms":[],"antonyms":[],"example":"Now that I've been promoted, I report to Benjamin, whom I loathe."},{"definition":"To return or present as the result of an examination or consideration of any matter officially referred.","synonyms":[],"antonyms":[],"example":"The committee reported the bill with amendments, or reported a new bill, or reported the results of an inquiry."},{"definition":"To take minutes of (a speech, the doings of a public body, etc.); to write down from the lips of a speaker.","synonyms":[],"antonyms":[]},{"definition":"To refer.","synonyms":[],"antonyms":[]},{"definition":"To return or repeat, as sound; to echo.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"The creation of reports, as for a business or a journal.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/report","https://en.wiktionary.org/wiki/reporting"]}]}