{"word":"token","rank":5043,"occurrence":0.0012054,"records":[{"word":"token","phonetic":"/ˈtəʊkən/","phonetics":[{"text":"/ˈtəʊkən/","audio":""},{"text":"/ˈtoʊkən/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/token-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=50423080","license":{"name":"BY-SA 4.0","url":"https://creativecommons.org/licenses/by-sa/4.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Something serving as an expression of something else.","synonyms":["sign","symbol"],"antonyms":[],"example":"According to the Bible, the rainbow is a token of God's covenant with Noah."},{"definition":"A keepsake.","synonyms":["memento","souvenir"],"antonyms":[],"example":"Please accept this bustier as a token of our time together."},{"definition":"A piece of stamped metal or plastic, etc., used as a substitute for money; a voucher that can be exchanged for goods or services.","synonyms":[],"antonyms":[],"example":"A book token is the easiest option for a Christmas gift."},{"definition":"(sometimes figurative) Evidence, proof; a confirming detail; physical trace, mark, footprint.","synonyms":[],"antonyms":[]},{"definition":"Support for a belief; grounds for an opinion.","synonyms":["reason","reasoning"],"antonyms":[]},{"definition":"An extraordinary event serving as evidence of supernatural power.","synonyms":["miracle"],"antonyms":[]},{"definition":"An object or disclosure to attest or authenticate the bearer or an instruction.","synonyms":["password"],"antonyms":[]},{"definition":"A seal guaranteeing the quality of an item.","synonyms":[],"antonyms":[]},{"definition":"Something given or shown as a symbol or guarantee of authority or right; a sign of authenticity, of power, good faith.","synonyms":[],"antonyms":[]},{"definition":"A tally.","synonyms":[],"antonyms":[]},{"definition":"A particular thing to which a concept applies.","synonyms":[],"antonyms":[]},{"definition":"An atomic piece of data, such as a word, for which a meaning may be inferred during parsing.","synonyms":["symbol"],"antonyms":[]},{"definition":"A conceptual object that can be possessed by a computer, process, etc. in order to regulate a turn-taking system such as a token ring network.","synonyms":[],"antonyms":[]},{"definition":"A meaningless placeholder used as a substitute for sensitive data.","synonyms":[],"antonyms":[]},{"definition":"(grammar) A lexeme; a basic, grammatically indivisible unit of a language such as a keyword, operator or identifier.","synonyms":[],"antonyms":[]},{"definition":"(corpus linguistics) A single example of a certain word in a text or corpus.","synonyms":[],"antonyms":["type"]},{"definition":"A characteristic sign of a disease or of a bodily disorder, a symptom; a sign of a bodily condition, recovery, or health.","synonyms":[],"antonyms":[]},{"definition":"A livid spot upon the body, indicating, or supposed to indicate, the approach of death.","synonyms":[],"antonyms":[]},{"definition":"Ten and a half quires, or, commonly, 250 sheets, of paper printed on both sides; also, in some cases, the same number of sheets printed on one side, or half the number printed on both sides.","synonyms":[],"antonyms":[]},{"definition":"A bit of leather having a peculiar mark designating a particular miner. Each hewer sends one of these with each corf or tub he has hewn.","synonyms":[],"antonyms":[]},{"definition":"A thin bed of coal indicating the existence of a thicker seam at no great distance.","synonyms":[],"antonyms":[]},{"definition":"A physical object used for exchange between drivers and signalmen on single track lines.","synonyms":[],"antonyms":[]},{"definition":"In a loom, a colored signal to show the weaver which shuttle to use.","synonyms":[],"antonyms":[]},{"definition":"(Church of Scotland) A piece of metal given beforehand to each person in the congregation who is permitted to partake of the Lord's Supper.","synonyms":[],"antonyms":[]}],"synonyms":["memento","souvenir","miracle","password","reason","reasoning","sign","symbol","symbol"],"antonyms":["type"]},{"partOfSpeech":"verb","definitions":[{"definition":"To betoken, indicate, portend, designate, denote","synonyms":[],"antonyms":[]},{"definition":"To betroth","synonyms":[],"antonyms":[]},{"definition":"To symbolize, instantiate","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"Done as an indication or a pledge; perfunctory, minimal or merely symbolic.","synonyms":[],"antonyms":[],"example":"He made a token tap on the brake pedal at the stop sign."},{"definition":"A minor attempt for appearance's sake, or to minimally comply with a requirement","synonyms":[],"antonyms":[],"example":"he was hired as the company's token black person"}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/token"]}]}