{"word":"cones","rank":12452,"occurrence":0.0001807,"records":[{"word":"cones","phonetics":[],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A surface of revolution formed by rotating a segment of a line around another line that intersects the first line.","synonyms":[],"antonyms":[]},{"definition":"A solid of revolution formed by rotating a triangle around one of its altitudes.","synonyms":[],"antonyms":[]},{"definition":"A space formed by taking the direct product of a given space with a closed interval and identifying all of one end to a point.","synonyms":[],"antonyms":[]},{"definition":"Anything shaped like a cone.","synonyms":[],"antonyms":[]},{"definition":"The fruit of a conifer.","synonyms":[],"antonyms":[]},{"definition":"A cone-shaped flower head of various plants, such as banksias and proteas.","synonyms":[],"antonyms":[]},{"definition":"An ice cream cone.","synonyms":[],"antonyms":[]},{"definition":"A traffic cone","synonyms":[],"antonyms":[]},{"definition":"A unit of volume, applied solely to marijuana and only while it is in a smokable state; roughly 1.5 cubic centimetres, depending on use.","synonyms":[],"antonyms":[]},{"definition":"Any of the small cone-shaped structures in the retina.","synonyms":[],"antonyms":[]},{"definition":"The bowl piece on a bong.","synonyms":[],"antonyms":[]},{"definition":"The process of smoking cannabis in a bong.","synonyms":[],"antonyms":[]},{"definition":"A cone-shaped cannabis joint.","synonyms":[],"antonyms":[]},{"definition":"A passenger on a cruise ship (so-called by employees after traffic cones, from the need to navigate around them)","synonyms":[],"antonyms":[]},{"definition":"An object V together with an arrow going from V to each object of a diagram such that for any arrow A in the diagram, the pair of arrows from V which subtend A also commute with it. (Then V can be said to be the cone’s vertex and the diagram which the cone subtends can be said to be its base.)","synonyms":[],"antonyms":[],"example":"A cone is an object (the apex) and a natural transformation from a constant functor (whose image is the apex of the cone and its identity morphism) to a diagram functor. Its components are projections from the apex to the objects of the diagram and it has a “naturality triangle” for each morphism in the diagram. (A “naturality triangle” is just a naturality square which is degenerate at its apex side.)"},{"definition":"A shell of the genus Conus, having a conical form.","synonyms":[],"antonyms":[]},{"definition":"A set of formal languages with certain desirable closure properties, in particular those of the regular languages, the context-free languages and the recursively enumerable languages.","synonyms":[],"antonyms":[]}],"synonyms":["conical surface","cornet","ice cream cone"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To fashion into the shape of a cone.","synonyms":[],"antonyms":[]},{"definition":"To form a cone shape.","synonyms":[],"antonyms":[]},{"definition":"(frequently followed by \"off\") To segregate or delineate an area using traffic cones","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/cone","https://en.wiktionary.org/wiki/cones"]}]}