{"word":"connected","rank":1677,"occurrence":0.0047128,"records":[{"word":"connected","phonetic":"/kəˈnɛktɪd/","phonetics":[{"text":"/kəˈnɛktɪd/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/connected-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=1669285","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"verb","definitions":[{"definition":"(of an object) To join (to another object): to attach, or to be intended to attach or capable of attaching, to another object.","synonyms":["affix","join","put together","unite"],"antonyms":[],"example":"I think this piece connects to that piece over there."},{"definition":"(of two objects) To join: to attach, or to be intended to attach or capable of attaching, to each other.","synonyms":[],"antonyms":[],"example":"Both roads have the same name, but they don't connect: they're on opposite sides of the river, and there's no bridge there."},{"definition":"(of an object) To join (two other objects), or to join (one object) to (another object): to be a link between two objects, thereby attaching them to each other.","synonyms":[],"antonyms":[],"example":"The new railroad will connect the northern part of the state to the southern part."},{"definition":"(of a person) To join (two other objects), or to join (one object) to (another object): to take one object and attach it to another.","synonyms":[],"antonyms":[],"example":"I connected the printer to the computer, but I couldn't get it work."},{"definition":"To join an electrical or telephone line to a circuit or network.","synonyms":[],"antonyms":[],"example":"When the technician connects my house, I'll be able to access the internet."},{"definition":"To associate; to establish a relation between.","synonyms":[],"antonyms":[],"example":"I didn't connect my lost jewelry with the news of an area cat burglar until the police contacted me."},{"definition":"To make a travel connection; to switch from one means of transport to another as part of the same trip.","synonyms":[],"antonyms":[],"example":"I'm flying to London where I connect with a flight heading to Hungary."}],"synonyms":["affix","join","put together","unite"],"antonyms":["disconnect"]},{"partOfSpeech":"adjective","definitions":[{"definition":"(usually with \"well-\"): Having favorable rapport with a powerful entity.","synonyms":[],"antonyms":[]},{"definition":"Having relationships; involved with others.","synonyms":[],"antonyms":[]},{"definition":"Involved with organized crime, specifically someone not (yet) working for a crime organization, but referred to as a \"friend\" by made guys/wise guys inside the organization.","synonyms":[],"antonyms":[]},{"definition":"Intimate; Having bonds of affection.","synonyms":[],"antonyms":[]},{"definition":"(of a topological space) That cannot be partitioned into two nonempty open sets.","synonyms":[],"antonyms":[]},{"definition":"(of a graph) Having a path, either directed or undirected, connecting every pair of vertices.","synonyms":[],"antonyms":[],"example":"In a connected graph, there is no section (proper subset that includes all edges from each vertex in said subset) of the graph that is isolated from the rest."},{"definition":"Having or supporting connections, especially when through technology such as networking software or a transportation network.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":["disconnected"]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/connect","https://en.wiktionary.org/wiki/connected"]}]}