{"word":"attacks","rank":4286,"occurrence":0.0015041,"records":[{"word":"attacks","phonetic":"/əˈtæks/","phonetics":[{"text":"/əˈtæks/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/attacks-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=2707453","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"An attempt to cause damage, injury to, or death of opponent or enemy.","synonyms":[],"antonyms":[]},{"definition":"An attempt to detract from the worth or credibility of, a person, position, idea, object, or thing, by physical, verbal, emotional, or other assault.","synonyms":[],"antonyms":[],"example":"They claimed the censorship of the article was an attack on free speech."},{"definition":"A time in which one attacks; the offence of a battle.","synonyms":[],"antonyms":[],"example":"The army timed their attack to coincide with the local celebrations."},{"definition":"(by extension) The beginning of active operations on anything.","synonyms":[],"antonyms":[],"example":"Having washed the plates from dinner, I made an attack on the laundry."},{"definition":"An attempt to exploit a vulnerability in a computer system.","synonyms":[],"antonyms":[]},{"definition":"Collectively, the bowlers of a cricket side.","synonyms":[],"antonyms":[]},{"definition":"Any contact with the ball other than a serve or block which sends the ball across the plane of the net.","synonyms":["hit","spike"],"antonyms":[]},{"definition":"The three attackmen on the field or all the attackmen of a team.","synonyms":[],"antonyms":[]},{"definition":"The sudden onset of a disease or condition.","synonyms":[],"antonyms":[],"example":"I've had an attack of the flu."},{"definition":"An active episode of a chronic or recurrent disease.","synonyms":[],"antonyms":[]},{"definition":"The onset of a musical note, particularly with respect to the strength (and duration) of that onset.","synonyms":[],"antonyms":["decay","release"]},{"definition":"(audio) The amount of time it takes for the volume of an audio signal to go from zero to maximum level (e.g. an audio waveform representing a snare drum hit would feature a very fast attack, whereas that of a wave washing to shore would feature a slow attack).","synonyms":[],"antonyms":[]}],"synonyms":["hit","spike"],"antonyms":["decay","release"]},{"partOfSpeech":"verb","definitions":[{"definition":"To apply violent force to someone or something.","synonyms":[],"antonyms":[],"example":"This species of snake will only attack humans if it feels threatened."},{"definition":"To aggressively challenge a person, idea, etc., with words (particularly in newspaper headlines, because it typesets into less space than \"criticize\" or similar).","synonyms":[],"antonyms":[],"example":"She published an article attacking the recent pay cuts."},{"definition":"To begin to affect; to act upon injuriously or destructively; to begin to decompose or waste.","synonyms":[],"antonyms":[]},{"definition":"To deal with something in a direct way; to set to work upon.","synonyms":[],"antonyms":[],"example":"I attacked the meal with a hearty appetite."},{"definition":"To aim balls at the batsman’s wicket.","synonyms":[],"antonyms":[]},{"definition":"To set a field, or bowl in a manner designed to get wickets.","synonyms":[],"antonyms":[]},{"definition":"To bat aggressively, so as to score runs quickly.","synonyms":[],"antonyms":[]},{"definition":"To move forward in an active attempt to score a point, as opposed to trying not to concede.","synonyms":[],"antonyms":[]},{"definition":"To accelerate quickly in an attempt to get ahead of the other riders.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/attack","https://en.wiktionary.org/wiki/attacks"]}]}