{"word":"extract","rank":5585,"occurrence":0.0010345,"records":[{"word":"extract","phonetics":[],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Something that is extracted or drawn out.","synonyms":[],"antonyms":[]},{"definition":"A portion of a book or document, incorporated distinctly in another work; a citation; a quotation.","synonyms":[],"antonyms":[],"example":"I used an extract of Hemingway's book to demonstrate culture shock."},{"definition":"A decoction, solution, or infusion made by drawing out from any substance that which gives it its essential and characteristic virtue","synonyms":[],"antonyms":[],"example":"extract of beef"},{"definition":"Any substance extracted is such a way, and characteristic of that from which it is obtained","synonyms":[],"antonyms":[],"example":"quinine is the most important extract of Peruvian bark."},{"definition":"A solid preparation obtained by evaporating a solution of a drug, etc., or the fresh juice of a plant (distinguished from an abstract).","synonyms":[],"antonyms":[]},{"definition":"A peculiar principle (fundamental essence) once erroneously supposed to form the basis of all vegetable extracts.","synonyms":[],"antonyms":[]},{"definition":"Ancestry; descent.","synonyms":[],"antonyms":[]},{"definition":"A draft or copy of writing; a certified copy of the proceedings in an action and the judgment therein, with an order for execution.","synonyms":[],"antonyms":[]}],"synonyms":["extraction","origin","extractive principle","extraction"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To draw out; to pull out; to remove forcibly from a fixed position, as by traction or suction, etc.","synonyms":[],"antonyms":[],"example":"to extract a tooth from its socket, a stump from the earth, or a splinter from the finger"},{"definition":"To withdraw by expression, distillation, or other mechanical or chemical process. Compare abstract (transitive verb).","synonyms":[],"antonyms":[],"example":"to extract an essential oil from a plant"},{"definition":"To take by selection; to choose out; to cite or quote, as a passage from a book.","synonyms":[],"antonyms":[]},{"definition":"To select parts of a whole","synonyms":[],"antonyms":[],"example":"We need to try to extract the positives from the defeat."},{"definition":"To determine (a root of a number).","synonyms":[],"antonyms":[],"example":"Please extract the cube root of 27."}],"synonyms":["outdraw","sunder out"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/extract"]}]}