{"word":"profile","rank":8641,"occurrence":0.0004576,"records":[{"word":"profile","phonetic":"/ˈpɹəʊfaɪl/","phonetics":[{"text":"/ˈpɹəʊfaɪl/","audio":""},{"text":"/ˈpɹoʊfaɪl/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The outermost shape, view, or edge of an object.","synonyms":[],"antonyms":[],"example":"His fingers traced the profile of the handle."},{"definition":"The shape, view, or shadow of a person's head from the side; a side view.","synonyms":[],"antonyms":[],"example":"The brooch showed the profile of a Victorian woman."},{"definition":"A summary or collection of information, especially about a person","synonyms":[],"antonyms":[],"example":"Law enforcement assembled a profile of the suspect."},{"definition":"A specific space or field in which users can provide various types of personal information in software or Internet systems.","synonyms":[],"antonyms":[],"example":"I just updated my Facebook profile to show I got engaged."},{"definition":"Reputation.","synonyms":[],"antonyms":[]},{"definition":"The amount by which something protrudes.","synonyms":[],"antonyms":[],"example":"Choose a handle with a low profile so it does not catch on things."},{"definition":"Prominence; noticeability.","synonyms":[],"antonyms":[],"example":"Acting is, by nature, profession in which one must keep a high profile."},{"definition":"A smoothed (e.g., troweled or brushed) vertical surface of an excavation showing evidence of at least one feature or diagnostic specimen; the graphic recording of such as by sketching, photographing, etc.","synonyms":[],"antonyms":[]},{"definition":"Character; totality of related characteristics; signature; status (especially in scientific, technical, or military uses).","synonyms":[],"antonyms":[],"example":"What's the thermal profile on that thing?"},{"definition":"A section of any member, made at right angles with its main lines, showing the exact shape of mouldings etc.","synonyms":[],"antonyms":[]},{"definition":"A drawing exhibiting a vertical section of the ground along a surveyed line, or graded work, as of a railway, showing elevations, depressions, grades, etc.","synonyms":[],"antonyms":[]},{"definition":"An exemption from certain types of duties due to injury or disability.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":["portrait"]},{"partOfSpeech":"verb","definitions":[{"definition":"To create a summary or collection of information about (a person, etc.).","synonyms":[],"antonyms":[]},{"definition":"To act based on such a summary, especially one that is a stereotype; to engage in profiling.","synonyms":[],"antonyms":[]},{"definition":"To draw in profile or outline.","synonyms":[],"antonyms":[]},{"definition":"To give a definite form by chiselling, milling, etc.","synonyms":[],"antonyms":[]},{"definition":"To measure the performance of various parts of (a program) so as to locate bottlenecks.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/profile"]}]}