{"word":"projection","rank":10384,"occurrence":0.0002908,"records":[{"word":"projection","phonetic":"/pɹəˈdʒɛkʃən/","phonetics":[{"text":"/pɹəˈdʒɛkʃən/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Something which projects, protrudes, juts out, sticks out, or stands out.","synonyms":[],"antonyms":[],"example":"The face of the cliff had many projections that were big enough for birds to nest on."},{"definition":"The action of projecting or throwing or propelling something.","synonyms":[],"antonyms":[]},{"definition":"The crisis or decisive point of any process, especially a culinary process.","synonyms":[],"antonyms":[]},{"definition":"The display of an image by devices such as movie projector, video projector, overhead projector or slide projector.","synonyms":[],"antonyms":[]},{"definition":"A forecast or prognosis obtained by extrapolation","synonyms":[],"antonyms":[]},{"definition":"A belief or assumption that others have similar thoughts and experiences as oneself","synonyms":[],"antonyms":[]},{"definition":"The image that a translucent object casts onto another object.","synonyms":[],"antonyms":[]},{"definition":"Any of several systems of intersecting lines that allow the curved surface of the earth to be represented on a flat surface. The set of mathematics used to calculate coordinate positions.","synonyms":[],"antonyms":[]},{"definition":"An image of an object on a surface of fewer dimensions.","synonyms":[],"antonyms":[]},{"definition":"An idempotent linear transformation which maps vectors from a vector space onto a subspace.","synonyms":[],"antonyms":[]},{"definition":"A transformation which extracts a fragment of a mathematical object.","synonyms":[],"antonyms":[]},{"definition":"A morphism from a categorical product to one of its (two) components.","synonyms":[],"antonyms":[]}],"synonyms":["protuberance"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/projection"]}]}