{"word":"protocol","rank":16796,"occurrence":0.0000699,"records":[{"word":"protocol","phonetic":"/ˈpɹəʊtəˌkɒl/","phonetics":[{"text":"/ˈpɹəʊtəˌkɒl/","audio":""},{"text":"/ˈpɹoʊtəˌkoʊl/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The minutes, or official record, of a negotiation or transaction; especially a document drawn up officially which forms the legal basis for subsequent agreements based on it.","synonyms":[],"antonyms":[]},{"definition":"An official record of a diplomatic meeting or negotiation; later specifically, a draft document setting out agreements to be signed into force by a subsequent formal treaty.","synonyms":[],"antonyms":[]},{"definition":"An amendment to an official treaty.","synonyms":[],"antonyms":[]},{"definition":"The first leaf of a roll of papyrus, or the official mark typically found on such a page.","synonyms":[],"antonyms":[]},{"definition":"The official formulas which appeared at the beginning or end of certain official documents such as charters, papal bulls etc.","synonyms":[],"antonyms":[]},{"definition":"The original notes of observations made during an experiment; also, the precise method for carrying out or reproducing a given experiment.","synonyms":[],"antonyms":[]},{"definition":"The official rules and guidelines for heads of state and other dignitaries, governing accepted behaviour in relations with other diplomatic representatives or over affairs of state.","synonyms":[],"antonyms":[]},{"definition":"(by extension) An accepted code of conduct; acceptable behaviour in a given situation or group.","synonyms":[],"antonyms":[]},{"definition":"A set of formal rules describing how to transmit or exchange data, especially across a network.","synonyms":[],"antonyms":[]},{"definition":"The set of instructions allowing a licensed medical professional to start, modify, or stop a medical or patient care order.","synonyms":[],"antonyms":[]}],"synonyms":["policy","procedure"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To make a protocol of.","synonyms":[],"antonyms":[]},{"definition":"To make or write protocols, or first drafts; to issue protocols.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/protocol"]}]}