{"word":"honour","rank":812,"occurrence":0.0092446,"records":[{"word":"honour","phonetic":"/ˈɒnə(ɹ)/","phonetics":[{"text":"/ˈɒnə(ɹ)/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/honour-uk.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=88987533","license":{"name":"BY-SA 4.0","url":"https://creativecommons.org/licenses/by-sa/4.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Recognition of importance or value; respect; veneration (of someone, usually for being morally upright or successful)","synonyms":[],"antonyms":[],"example":"The crowds gave the returning general much honor and praise."},{"definition":"The state of being morally upright, honest, noble, virtuous, and magnanimous; excellence of character; the perception of such a state; favourable reputation; dignity","synonyms":[],"antonyms":[],"example":"He was a most perfect knight, for he had great honor and chivalry."},{"definition":"A token of praise or respect; something that represents praiseworthiness or respect, such as a prize or award given by the state to a citizen","synonyms":[],"antonyms":[],"example":"Audie Murphy received many honors, such as the Distinguished Service Cross."},{"definition":"A privilege","synonyms":[],"antonyms":[],"example":"I had the honour of dining with the ambassador."},{"definition":"(in the plural) the privilege of going first","synonyms":[],"antonyms":[],"example":"I'll let you have the honours, Bob—go ahead."},{"definition":"A cause of respect and fame; a glory; an excellency; an ornament.","synonyms":[],"antonyms":[],"example":"He is an honour to his nation."},{"definition":"(feudal law) a seigniory or lordship held of the king, on which other lordships and manors depended","synonyms":[],"antonyms":[]},{"definition":"The center point of the upper half of an armorial escutcheon (compare honour point)","synonyms":[],"antonyms":[]},{"definition":"In bridge, an ace, king, queen, jack, or ten especially of the trump suit. In some other games, an ace, king, queen or jack.","synonyms":[],"antonyms":[]},{"definition":"(in the plural) (courses for) an honours degree: a university qualification of the highest rank","synonyms":[],"antonyms":[],"example":"At university I took honours in modern history."}],"synonyms":["chivalry","gentlemanliness","glory"],"antonyms":["dishonor"]},{"partOfSpeech":"verb","definitions":[{"definition":"To think of highly, to respect highly; to show respect for; to recognise the importance or spiritual value of","synonyms":[],"antonyms":[],"example":"The freedom fighters will be forever remembered and honored by the people."},{"definition":"To conform to, abide by, act in accordance with (an agreement, treaty, promise, request, or the like)","synonyms":[],"antonyms":[],"example":"I trusted you, but you have not honored your promise."},{"definition":"To confer (bestow) an honour or privilege upon (someone)","synonyms":[],"antonyms":[],"example":"Ten members of the profession were honored at the ceremony."},{"definition":"To make payment in respect of (a cheque, banker's draft, etc.)","synonyms":[],"antonyms":[],"example":"I'm sorry Sir, but the bank did not honour your cheque."}],"synonyms":["worthy"],"antonyms":["contempt","despise"]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/honor","https://en.wiktionary.org/wiki/honour"]}]}