{"word":"scratch","rank":7814,"occurrence":0.0005726,"records":[{"word":"scratch","phonetic":"/skɹætʃ/","phonetics":[{"text":"/skɹætʃ/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/scratch-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=282142"}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A disruption, mark or shallow cut on a surface made by scratching.","synonyms":[],"antonyms":[],"example":"Her skin was covered with tiny scratches."},{"definition":"An act of scratching the skin to alleviate an itch or irritation.","synonyms":[],"antonyms":[],"example":"The dog sat up and had a good scratch."},{"definition":"A starting line (originally and simply, a line scratched in the ground), as in boxing.","synonyms":[],"antonyms":[]},{"definition":"A technical error of touching or surpassing the starting mark prior to the official start signal in the sporting events of long jump, discus, hammer throw, shot put, and similar. Originally the starting mark was a scratch on the ground but is now a board or precisely indicated mark.","synonyms":[],"antonyms":[]},{"definition":"The last riders to depart in a handicap race.","synonyms":[],"antonyms":[]},{"definition":"An aberration.","synonyms":[],"antonyms":[]},{"definition":"A horse withdrawn from a race prior to the start.","synonyms":[],"antonyms":[],"example":"There were two scratches in race 8, which reduced the field from 9 horses to 7."},{"definition":"Money.","synonyms":[],"antonyms":[]},{"definition":"A feed, usually a mixture of a few common grains, given to chickens.","synonyms":[],"antonyms":[]},{"definition":"(in the plural) Minute, but tender and troublesome, excoriations, covered with scabs, upon the heels of horses which have been used where it is very wet or muddy.","synonyms":[],"antonyms":[]},{"definition":"A scratch wig.","synonyms":[],"antonyms":[]},{"definition":"A genre of Virgin Islander music, better known as fungi.","synonyms":[],"antonyms":[]}],"synonyms":["fungi","quelbe"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To rub a surface with a sharp object, especially by a living creature to remove itching with nails, claws, etc.","synonyms":[],"antonyms":[],"example":"Could you please scratch my back?"},{"definition":"To rub the skin with rough material causing a sensation of irritation; to cause itching.","synonyms":[],"antonyms":[],"example":"I don't like that new scarf because it scratches my neck."},{"definition":"To mark a surface with a sharp object, thereby leaving a scratch (noun).","synonyms":[],"antonyms":[],"example":"A real diamond can easily scratch a pane of glass."},{"definition":"To cross out, strike out, strike through some text on a page.","synonyms":[],"antonyms":[]},{"definition":"To produce a distinctive sound on a turntable by moving a vinyl record back and forth while manipulating the crossfader (see also scratching).","synonyms":[],"antonyms":[]},{"definition":"To commit a foul in pool, as where the cue ball is put into a pocket or jumps off the table.","synonyms":[],"antonyms":[],"example":"Embarrassingly, he scratched on the break, popping the cue completely off the table."},{"definition":"To score, not by skillful play but by some fortunate chance of the game.","synonyms":[],"antonyms":[]},{"definition":"To write or draw hastily or awkwardly; scrawl.","synonyms":[],"antonyms":[]},{"definition":"To dig or excavate with the claws.","synonyms":[],"antonyms":[],"example":"Some animals scratch holes, in which they burrow."},{"definition":"To dig or scrape (a person's skin) with claws or fingernails in self-defense or with the intention to injure.","synonyms":[],"antonyms":[],"example":"The cat scratched the little girl."}],"synonyms":["scrattle"],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"For or consisting of preliminary or tentative, incomplete, etc. work.","synonyms":[],"antonyms":[],"example":"This is scratch paper, so go ahead and scribble whatever you want on it."},{"definition":"Hastily assembled, arranged or constructed, from whatever materials are to hand, with little or no preparation","synonyms":[],"antonyms":[]},{"definition":"(from scratchpad) Relating to a data structure or recording medium attached to a machine for testing or temporary use.","synonyms":[],"antonyms":[]},{"definition":"(of a player) Of a standard high enough to play without a handicap, i.e. to compete without the benefit of a variation in scoring based on ability.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/scratch"]}]}