{"word":"scroll","rank":10487,"occurrence":0.0002848,"records":[{"word":"scroll","phonetic":"/skɹoʊl/","phonetics":[{"text":"/skɹoʊl/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A roll of paper or parchment; a writing formed into a roll.","synonyms":[],"antonyms":[]},{"definition":"An ornament formed of undulations giving off spirals or sprays, usually suggestive of plant form. Roman architectural ornament is largely of some scroll pattern.","synonyms":[],"antonyms":[]},{"definition":"Spirals or sprays in the shape of an actual plant.","synonyms":[],"antonyms":[]},{"definition":"A mark or flourish added to a person's signature, intended to represent a seal, and in some States allowed as a substitute for a seal. [U.S.] Alexander Mansfield Burrill.","synonyms":[],"antonyms":[]},{"definition":"The carved end of a violin, viola, cello or other stringed instrument, most commonly scroll-shaped but occasionally in the form of a human or animal head.","synonyms":[],"antonyms":[]},{"definition":"A skew surface.","synonyms":[],"antonyms":[]},{"definition":"A kind of sweet roll baked in a somewhat spiral shape.","synonyms":[],"antonyms":[],"example":"I ordered a glass of lemonade and a coffee scroll."},{"definition":"The incremental movement of graphics on a screen, removing one portion to show the next.","synonyms":[],"antonyms":[]},{"definition":"(hydraulics) A spiral waterway placed round a turbine to regulate the flow.","synonyms":[],"antonyms":[]},{"definition":"A turbinate bone.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To change one's view of data on a computer's display, typically using a scroll bar or a scroll wheel to move in gradual increments.","synonyms":[],"antonyms":[],"example":"She scrolled the offending image out of view."},{"definition":"To move in or out of view horizontally or vertically.","synonyms":[],"antonyms":[],"example":"The rising credits slowly scrolled off the screen."},{"definition":"To flood a chat system with numerous lines of text, causing legitimate messages to scroll out of view before they can be read.","synonyms":[],"antonyms":[],"example":"Hey, stop scrolling!"}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/scroll"]}]}