{"word":"center","rank":3611,"occurrence":0.0018747,"records":[{"word":"center","phonetic":"/ˈsɛn.tə(ɹ)/","phonetics":[{"text":"/ˈsɛn.tə(ɹ)/","audio":""},{"text":"/ˈsɛn.tɚ/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"The point in the interior of a circle that is equidistant from all points on the circumference.","synonyms":[],"antonyms":[]},{"definition":"The point in the interior of a sphere that is equidistant from all points on the circumference.","synonyms":[],"antonyms":[]},{"definition":"The middle portion of something; the part well away from the edges.","synonyms":[],"antonyms":[]},{"definition":"The point on a line that is midway between the ends.","synonyms":[],"antonyms":[]},{"definition":"The point in the interior of any figure of any number of dimensions that has as its coordinates the arithmetic mean of the coordinates of all points on the perimeter of the figure (or of all points in the interior for a center of volume).","synonyms":[],"antonyms":[]},{"definition":"The subgroup (respectively, subring), denoted Z(G), of those elements of a given group (respectively, ring) G that commute with every element of G.","synonyms":[],"antonyms":[]},{"definition":"A place where the greater part of some function or activity occurs.","synonyms":[],"antonyms":[],"example":"shopping center, convention center, civic center, garment center, Lincoln Center for the Performing Arts, Rockefeller Center"},{"definition":"A topic that is particularly important in a given context.","synonyms":[],"antonyms":[],"example":"the center of attention"},{"definition":"A player in the middle of the playing area","synonyms":[],"antonyms":[]},{"definition":"A player who can go all over the court, except the shooting circles.","synonyms":[],"antonyms":[]},{"definition":"A pass played into the centre of the pitch.","synonyms":[],"antonyms":[]},{"definition":"One of the backs operating in a central area of the pitch, either the inside centre or outside centre.","synonyms":[],"antonyms":[]},{"definition":"A temporary structure upon which the materials of a vault or arch are supported in position until the work becomes self-supporting.","synonyms":[],"antonyms":[]},{"definition":"One of the two conical steel pins in a lathe, etc., upon which the work is held, and about which it revolves.","synonyms":[],"antonyms":[]},{"definition":"A conical recess or indentation in the end of a shaft or other work, to receive the point of a center, on which the work can turn, as in a lathe.","synonyms":[],"antonyms":[]},{"definition":"The ensemble of moderate or centrist political parties.","synonyms":[],"antonyms":[]}],"synonyms":["middle","midst","center of gravity","center of mass","centroid","midpoint"],"antonyms":["periphery"]},{"partOfSpeech":"verb","definitions":[{"definition":"To cause (an object) to occupy the center of an area.","synonyms":[],"antonyms":[],"example":"He centered the heading of the document."},{"definition":"To cause (some attribute, such as a mood or voltage) to be adjusted to a value which is midway between the extremes.","synonyms":[],"antonyms":[]},{"definition":"To give (something) a central basis.","synonyms":[],"antonyms":[]},{"definition":"To concentrate on (something), to pay close attention to (something).","synonyms":[],"antonyms":[],"example":"The discussion centered around the recent issues."},{"definition":"To form a recess or indentation for the reception of a center.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"adjective","definitions":[{"definition":"Of, at, or related to a center.","synonyms":[],"antonyms":[]}],"synonyms":["central"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/center"]}]}