{"word":"stake","rank":4585,"occurrence":0.0013738,"records":[{"word":"stake","phonetic":"/steɪk/","phonetics":[{"text":"/steɪk/","audio":"https://api.dictionaryapi.dev/media/pronunciations/en/stake-us.mp3","sourceUrl":"https://commons.wikimedia.org/w/index.php?curid=1769778","license":{"name":"BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"}}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A piece of wood or other material, usually long and slender, pointed at one end so as to be easily driven into the ground as a marker or a support or stay.","synonyms":[],"antonyms":[],"example":"We have surveyor's stakes at all four corners of this field, to mark exactly its borders."},{"definition":"A piece of wood driven in the ground, placed in the middle of the court, that is used as the finishing point after scoring 12 hoops in croquet.","synonyms":[],"antonyms":[]},{"definition":"A stick inserted upright in a lop, eye, or mortise, at the side or end of a cart, flat car, flatbed trailer, or the like, to prevent goods from falling off.","synonyms":[],"antonyms":[]},{"definition":"(with definite article) The piece of timber to which a person condemned to death was affixed to be burned.","synonyms":[],"antonyms":[],"example":"Thomas Cranmer was burnt at the stake."},{"definition":"A share or interest in a business or a given situation.","synonyms":[],"antonyms":[],"example":"The owners let the managers eventually earn a stake in the business."},{"definition":"That which is laid down as a wager; that which is staked or hazarded; a pledge.","synonyms":[],"antonyms":[]},{"definition":"A small anvil usually furnished with a tang to enter a hole in a bench top, as used by tinsmiths, blacksmiths, etc., for light work, punching hole in or cutting a work piece, or for specific forming techniques etc.","synonyms":[],"antonyms":[]},{"definition":"A territorial division comprising all the Mormons (typically several thousand) in a geographical area.","synonyms":[],"antonyms":[]}],"synonyms":["peg"],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To fasten, support, defend, or delineate with stakes.","synonyms":[],"antonyms":[],"example":"to stake vines or plants"},{"definition":"To pierce or wound with a stake.","synonyms":[],"antonyms":[]},{"definition":"To put at risk upon success in competition, or upon a future contingency.","synonyms":[],"antonyms":[]},{"definition":"To provide another with money in order to engage in an activity as betting or a business venture.","synonyms":[],"antonyms":[],"example":"His family staked him $10,000 to get his business started."}],"synonyms":["bet","hazard","wager"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/stake"]}]}